var ZwdsInfo = function () {
  // 文案表
  var info = [
    {
      'msg': [
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '天府是紫引牌中的統合之神，這張牌擁有穩定、通才、財庫、權勢的特質。',
        '你的命宮是紫微與天府兩顆星曜的組合。(簡稱紫府)',
        '命宮是紫府的人擁有一股凌駕於他人的架勢，穩重外表藏著不願意輸給任何人的企圖心。擁有統合權威的能力，愈處在紫府的能量裡，愈能接受上天給予的各方資源'
      ],
      'advantage_title': '紫府優勢',
      'advantage': '資源豐富，統合力及承擔力強，資源人脈透過自己的整合可以創造更高的價值。',
      'disadvantage_title': '紫府缺點',
      'disadvantage': '固執堅持己見，空有想法卻沒行動力，愛指揮跟擺派頭，有時得罪別人而不自知，反而造成自己的困擾。',
      'heart_title': '紫府提升能量的內心對白',
      'heart': [
        '『我相信我自己，這是我個性中權威的本質，我有能力去帶領大家往更好的境界提升，我也願意放下自大與傲慢，接受領導也能領導別人，願意勇敢追夢也會欣然接受上天給予的任何考驗，那將是豐富人生的元素，也在每個事件當中習得經驗』。',
        '２０１６年的紫府在工作領域是重新定位的一年，工作上會面臨到階段性的調整，調整的當下會感覺到不舒服，可是這樣的調整反而能為自己奠定基礎，所以首先找出自己在事業上的定位，在工作中想要到達什麼樣的目標跟成就，什麼是要取捨的？而到達目標跟成就一定會歷經過程，好好利用２０１６的能量把執行計劃制定出來並且按步就班執行。好消息是：在２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來協助自己更上一層樓的，切勿跟這樣的力量相競爭，競爭只是減弱彼此的力量，合作才能開創全新的局面。'
      ]
    },
    {
      'msg': [
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '命宮是天機獨坐的人擁有解決任何情況的能力，在略顯孤傲的表相之下，內在隱藏著智慧，而不急不徐的態度能化解所有的狀況，善良的自己為了不替別人造成困擾總是一人面對所有的事，但人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機星的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '天機獨坐優勢',
      'advantage': '聰明反應快，心思細膩，考慮周詳，做事接步就班，一步一腳印。',
      'disadvantage_title': '天機獨坐缺點',
      'disadvantage': '空有想法，行動力不足，沒有周全的計劃不上路，沒有人帶領，不敢衝。',
      'heart_title': '天機獨坐提升能量的內心對白',
      'heart': [
        '『相信自己的判斷，自己有智慧去面對所有事情的困難，此刻願意和大家一起攜手並進，在這樣的事件當中讓每個人都能成長』。',
        '２０１６年是天機獨坐再次突破的一年，過往作好的計劃，今年是實現的最佳時機，２０１６年是人脈大幅擴展的一年，這些人脈來自各個行業，統合好將會擁有超過想像的資源，而想要統合這群混雜著龍蛇的團隊，首先要學會判斷機緣，多跟專業人士交流，整合彼此的資訊，相互資源整合，將對雙方都有很大的助益，但若只是想要獲取對方的好處，卻不願意付出，也會踏進對方精心安排好的陷阱，因此一步一腳印，心念正面向上，總結：２０１６是機會多多，同時也是陷阱多多的一年，相信自己的專業，在專業上再突破，不熟的領域，機會再好，請多三思。'
      ]
    },
    {
      'msg': [
        '破軍是紫引牌中的溼婆神，這張牌擁有權力、消耗、破壞、創造的特質。',
        '你的命宮是破軍獨坐。',
        '命宮是破軍獨坐的人擁有重生的能量，自己有十足的堅持力跟創意，只要立下目標，不管要付出什麼代價，一定讓目標實現，自己決不放棄，自己是堅強的創造者，領導著整個團隊往前，挫折是成功的過程，改變是讓自己去學習成長進而讓自己邁向成功之路，改變創造出全新的機緣，勇敢接受並面對，自己每一步都是走向光明的未來。愈處在破軍的能量裡，愈有勇氣告別過去，迎接新的未來，這是一種狀態改變的能量，讓大家都進化的力量。'
      ],
      'advantage_title': '破軍優勢',
      'advantage': '創意改革、堅持突破，為了心中的理念，不惜花費任何代價，都要實現。',
      'disadvantage_title': '破軍缺點',
      'disadvantage': '消耗自己同時也把身邊人的能量消耗光，任何代價是用在乎自己的人去付的。',
      'heart_title': '破軍提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，我讓經驗來協助改變，一個全然不同的自己，正在前面等待著，自己走的路，自己開創，我要走一條所有人都沒走過的路』。',
        '２０１６年是破軍扭轉想法的一年，過去的模式將會面臨重大的考驗，此時的局面是我不犯別人，別人卻大軍壓境，逃避不是方法，兵來將擋，水來土掩，只有面對面硬碰硬才有活路，既然要互相競爭了，整體規劃是必須的，找志同道合的人加入戰局，出發前把計劃跟資金都準備好，統合專業人士的意見，一方面聽取建議，一方面也讓自己的專業再提升。在態勢未明之時，照計劃執行是非常重要的，充分授權給專業人士，甚至作全面性的沙盤推演，將可讓自己立於不敗之地。'
      ]
    },
    {
      'msg': [
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '命宮是太陽獨坐的人熱情與付出會讓事件往光明面去發展，自己是所有狀況的核心，積極貢獻的態度一定能化解所有的狀況，太陽的能量具有散發和溫暖的性質，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在太陽星的能量裡，愈能接受到上天持續關愛的能量。'
      ],
      'advantage_title': '太陽獨坐優勢',
      'advantage': '熱情活躍，教化付出，人緣好行動力十足，只要自己想要的，就會努力去達成。',
      'disadvantage_title': '太陽獨坐缺點',
      'disadvantage': '做事三分鐘熱度，願景很美好但過程中變化太多，不如自己預期就放棄。',
      'heart_title': '太陽獨坐提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，我願意放下一切，我是所有狀況的核心，我相信用積極貢獻的態度一定能化解所有的狀況』。',
        '２０１６年是太陽獨坐自我沈澱的一年，事業的部份必須建立系統及ｓｏｐ流程，讓所有人都清楚明白自己的責任及作法，每個人都愈清楚，結果將會更理想，２０１６是內部整頓的一年，而想要內部整頓，首先要先改變過去的思維，將過去的作法及想法作大幅度的改變，先接受可能性的想法，再來找怎麼作的作法，然後建立團隊文化及責任分配，文化的建立需要長時間的經營，一旦建立之後就會形成系統，這樣的系統是未來複製的原型，而自己在２０１６年最大的收獲就是把原型建立起來。'
      ]
    },
    {
      'msg': [
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '命宮是武曲獨坐的人能力足夠去成就任何的大事，謹慎選擇想法及點子將讓自己財富更旺，自己有能力點石成金，讓原本平凡無奇的計畫變成生意盎然，只有不畏風險勇於承擔責任，才能讓所有參與者都豐盛，愈處在武曲的能量裡，愈能收到上天持續不斷付予的顯化力，這是一種讓所有想法都實現的能量，感恩為此產生的美好結果。'
      ],
      'advantage_title': '武曲獨坐優勢',
      'advantage': '辛勤努力，堅持不懈，認真負責拼第一，只要訂下的目標，不管花多久時間，一定實現。',
      'disadvantage_title': '武曲獨坐缺點',
      'disadvantage': '冷酷不講情面，個性硬，作風硬，硬碰硬就是雙輸的局面。',
      'heart_title': '武曲獨坐提升能量的內心對白',
      'heart': [
        '『我堅持目標，努力實踐目標來激勵自己，擁有清晰而特定的目標，自己是有行動力的，我重視失敗帶來的學習，因為不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年是武曲獨坐豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，整合好同業的資源，形成同盟聯邦的概念，因此弟兄們愈多的團隊，在２０１６年勝出的機率會高很多，而市場永遠是自己最好的導師，誰擁有最大的市場，就證明誰是行的通，整合好同業的資源及通路，市場作大，自己會成為最大的贏家，過程決不輕鬆，卻會創造非常有價值跟收獲的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產的功課，此時是危機入市的好時機，如果都沒接觸過，此時也是很好學習不動產的一年，至於在工作上，明年是加速團隊前進的一年，彼此良性競爭，既是合作對象又是競爭對手，如此產生的正能量，將訓練出一群有戰鬥力的團隊。'
      ]
    },
    {
      'msg': [
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '命宮是天同獨坐的人有能力去協調所有人、事、物、情，讓所有人都開心，事都往正向的發展，物都創造最大的價值，情都有疏通的管道，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，愈處在天同的能量裡，愈能在人際之間取得創意，這是一種讓想法及情感流動的能量，感恩為此產生的美好結果。'
      ],
      'advantage_title': '天同獨坐優勢',
      'advantage': '一生運勢逢凶化吉，作風簡單純真，赤子之心和好奇心都是自己最棒的特質。',
      'disadvantage_title': '天同獨坐缺點',
      'disadvantage': '生活白癡遇事不知如何處理，忙碌時很忙碌，慵懶時很慵懶，時間分配是最大弱點。',
      'heart_title': '天同獨坐提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，人生可以一起攜手向前是福報，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年是天同獨坐機會滿滿的一年，首先大環境會為自己創造非常多的機會，不管是新朋友還是資源，２０１６年是深度連結的開始，而知識永遠是自己最好的靠山，跟愈多的專家交流，就可以得到最大的助力，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，不用擔心任何人的評論，放手去作，遇到任何困難也都會出現助手來幫忙，在辛苦忙碌的２０１６年，也要為自己留下個代表作，一個可以留下精彩生命記憶的作品，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '七殺是紫引牌中的成敗之神，這張牌擁有威嚴、紀律、剛強、變動的特質。',
        '你的命宮是七殺獨坐。',
        '命宮是七殺獨坐的人擁有決戰第一線的能量，自己十足的執行力跟行動力，只要訂下任務，不管多艱辛困難，一定讓自己使命必達，自己總是衝第一，為的不是自己的私慾，而是團隊所有人更光明的未來，自己是勇敢的領導者，領導著整個團隊往前，挫折會成為未來成功的墊腳石，勇敢跨出每一步，每一步都是光明的未來。愈處在七殺的能量裡，愈發現充滿了幹勁及渴望，這是一種突破現況的能量，讓大家都前進的力量。'
      ],
      'advantage_title': '七殺優勢',
      'advantage': '耐操好用拚第一，積極果斷不遲疑，目標明顯一路前行不怕苦不怕難。',
      'disadvantage_title': '七殺缺點',
      'disadvantage': '衝動行事好後悔，一將功成萬骨枯，再回頭已百年身，容易給人踩著別人肩膀往上爬的感覺。',
      'heart_title': '七殺提升能量的內心對白',
      'heart': [
        '『人生由我開創，承擔任何的決定，我將理性的看待所有事，果決、堅持是自己最大的利器，不畏困難在夢想尚未到手之前，自己絕不放手』。',
        '２０１６年是七殺提升自我、貢獻他人的一年，過去的人際關係將會面臨重大的考驗，此時正是提升自我專業最好的時間點，向上位者或長輩請教，他們擁有自己沒有的資源與人脈，虛心請教將可得到預料之外的協助，對方的模式、系統或建議會是很好的參考。整合自己的人際關係，好好分辨哪些團隊可以產生理念跟價值，人脈連結的深度比廣度還來得重要，２０１６年第一：要好好的控管自身的情緒（包括感情），過去都已經發生了，只有放眼未來，著重在下一步才能讓自己更美好，無謂的情緒，請在最短的時間處理好。第二：內部的支援系統要建立起來，要能應付連結的上層能量，如此才能產生豐盛的結果。'
      ]
    },
    {
      'msg': [
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的命宮是天梁獨坐。',
        '命宮是天梁獨坐的人擁有教化貢獻的能量，自己成熟的想法、穩定踏實的作法，不論是跟自己有關係的親朋好友或沒關係的民眾，自己總是願意貢獻所長讓對方更好。自己有能力可以提升對方到另一個層次，專注聆聽每個人內在的小聲音，會很清楚知道對方需要什麼樣的建議，自己就有這樣神奇的力量。愈處在天梁的能量裡，愈發現自己擁有敦厚、仁慈的特質，這是一種照顧的能量，讓身、心、靈都愉悅的力量。'
      ],
      'advantage_title': '天梁優勢',
      'advantage': '黑白分明有原則，急公好義好熱心，一步一腳印務實的走下一步。',
      'disadvantage_title': '天梁缺點',
      'disadvantage': '堅持己見有理說不清，好為人師愛嘮叨，管太多總讓人感到不舒服。',
      'heart_title': '天梁提升能量的內心對白',
      'heart': [
        '『我聆聽內在最深的聲音，清楚知道為何而作，深知自己有治癒任何人的能力，能力所及一定竭盡所能，我注定會有個不凡的人生，我總知道哪一條是正確的道路，我！相信自己！』。',
        '２０１６年是天梁理念提升的一年，走出自己的舒適圈，放下既有的成績，誠心跟強者請教，彼此的交流可以得到最新的訊息及想法，放下過往的成就向眾人請教，別人的想法是打開自己智慧的鑰匙，彼此間觀念的交流，反而讓自己看清楚盲點，決定改變，走出去才能執行出來，先依計劃來執行再依狀況作調整，訂出施行步驟及時間表，能否確實執行，將決定２０１６是否豐收，自己要有產業共好分食市場的概念，彼此合作彼此交流是雙贏最好的方式，最後在２０１６年要好好的調整自身的人際關係，有共識的朋友才能一起往前走，事情有輕重緩急，朋友有遠近親疏，如何選擇是關鍵。'
      ]
    },
    {
      'msg': [
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '天相是紫引牌中的協調、調度之神，這張牌擁有盡責、福善、面子、隨和的特質。',
        '你的命宮是廉貞與天相兩顆星曜的組合。(簡稱廉相)',
        '命宮是廉相的人是一個高度協調懂得如何授權與團隊合作的人，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，本身擁有審判、核准的力量，這樣的能量會決定所有人的未來，人與人之間的互動會讓自己充滿對生命的熱情！大家都必須聽從自己的分派，敞開心接受人與人之間流動的能量，讓自己冒險去突破，將會得到全然不同的新體驗，新體驗讓自己開創人生新的可能性。愈處在廉相的能量裡，愈能在天地之間取得規則，所以規則透過自己來交流，這是一種制定管理規則的能量，這樣的能量可以形成法規，影響所有的生命。'
      ],
      'advantage_title': '廉相優勢',
      'advantage': '說到作到，精通人情世故，該柔時柔，該要求時很要求，一生資源不斷。',
      'disadvantage_title': '廉相缺點',
      'disadvantage': '權勢慾望重，爭權奪利放不下，游走各個勢力範圍容易給人笑裡藏刀的感覺。',
      'heart_title': '廉相提升能量的內心對白',
      'heart': [
        '『我會以樂觀的態度和信心協調所有的人、事、物，讓每個人、事、物都在自身的位置發揮出最大的價值，任何人有任何難關，我們都會一起面對，凡能力所及一定竭盡所能，我注定會有個不凡的人生經驗，我是生命的主人，能主宰人生往想要的方向前進，掌握人生的規則秩序，我的人生將從此不同』。',
        '２０１６年是廉相提升境界的一年，首先過去在各領域的努力，會在２０１６年開花結果，是往下個階段前進的時候了，過去受到大家的照顧，前進當然也是大家一起前進，既然要一起前進，首先凝聚眾人的共識，結合成一個團隊，如何讓大家各司其職，發揮最大的戰力，就靠自己居中協調了，要整合協調這樣的團隊，絕非易事，行動力跟執行力都要再加倍，也要學會責任分擔跟充分授權，讓每個人都出１％的力量，百人聚集就有１００％的結果了。'
      ]
    },
    {
      'msg': [
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的命宮是巨門獨坐。',
        '命宮是巨門獨坐的人擁有內外連結的能量，自己能觀察到所有人外部行為想表達的內在聲音，或許是透過物品、事件、聲音或行為，自己總是可以連結到對方內在沒有表達出來的真正想法。找尋這些訊息與自己之間的相關性或共通性，它們將是實現目標的引導，調整好自己的狀態，自己將更有效的利用時間、金錢跟資源。愈處在巨門的能量裡，愈能把身邊凌亂的狀態去除，這是一種化繁為簡的能量，讓人、事、物都展現價值的力量。'
      ],
      'advantage_title': '巨門優勢',
      'advantage': '冷靜理性，敏銳觀察力強，腦筋靈活反應快，一生資源不斷，口才表達是自己最好的本事。',
      'disadvantage_title': '巨門缺點',
      'disadvantage': '疑心重，有話不說清楚，非常容易造成別人的誤解，心直口快容易禍從口出。',
      'heart_title': '巨門提升能量的內心對白',
      'heart': [
        '『以肯定的話語給出承諾，凡我承諾一定達成，天地之間必來協助，自己的話語是有力量的，這樣的力量影響著天地萬物，我必把這股力量用在提升所有人的生活品質』。',
        '２０１６年是巨門財官雙美的一年，工作上有非常多的機會產生，人跟人之間的交流，上下整合左右合作，可以創造出更多的契機，好的機會跟點子，需要計劃來執行，人與人交流也需要有個方向來討論，當所有人都到對的位置，所以事都照時間執行，所以物都歸定位，豐盛美好的果實只是伴隨而來的結果，在這其中惟一需要注意的是：法規的問題，合法性是２０１６年的第一指導原則，利再大，機會再好，只要牽涉到法律，一律不碰，謹記：留住青山在，不怕沒柴燒。'
      ]
    },
    {
      'msg': [
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是貪狼獨坐。',
        '命宮是貪狼獨坐的人擁有的是全世界最強大的任何能量，自己能喜悅的去創造奇蹟與實現願望，愈是輕鬆的態度愈能為自己開創全新的局面。雖然狀況很多讓自己非常忙碌，不過自己非常清楚當下的每個位置，自己擁有足夠的能力去改變所有的遊戲規則，本身多才多藝，學習力強，應變快，善念將造福所有人讓局面多贏，天賦才華用在哪裡，哪裡就得到成就。愈處在貪狼的能量裡，愈能在天地之間取得能量，這是一種豐富多元的能量，讓人、事、物都提升境界的力量。'
      ],
      'advantage_title': '貪狼優勢',
      'advantage': '多才多藝，個性積極不放棄，多變靈活，堅持前進，不達目標絕不停止。',
      'disadvantage_title': '貪狼缺點',
      'disadvantage': '性急好動沒耐心，坐這山望那山不滿足，改來變去給人感覺高度的不定性。',
      'heart_title': '貪狼提升能量的內心對白',
      'heart': [
        '『我清楚明白如何可以讓所有人都變的更好，我不只為了自身的慾望而是全體生命，如此天地將是自己的遊樂場，我將會把所有能量累積至最高的正能量，天地將因自己而有所不同』。',
        '２０１６年是貪狼結交同好的一年，人生觀相同才能成為知己，人脈要能合作才叫人脈，認識愈多的人，才能從中找到知己同好，因此廣泛的認識人，對自己會很有幫助，而想要讓別人印象深刻，必須有自己的代表作，一個能表達自己理念及人生觀的作表作，有整個２０１６年，讓自己去完成這樣的作品，另外在事業上，也必須要有作戰的盟友，夥伴不用多，精兵反而有戰力，交流彼此的想法，資源互相交換，有共同的目標及願景，市場很大，不用什麼都想要拿到，在某個領域作到位，反而會異軍突起，受到大家的矚目。'
      ]
    },
    {
      'msg': [
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的命宮是太陰獨坐。',
        '命宮是太陰獨坐的人擁有的是全世界最強大的溫柔能量，當自己打開心門時，情感、財富、機緣及療癒性的能量都會進入生命當中，不用讓未知的情況來困擾自己，自己很有力量。發揮持續、包容、體貼的力量，這樣的能量足以改變生命層次，自己是受到上天給予祝福的，上天也會讓自己感受到生命的喜悅。愈處在太陰的能量裡，愈能在人與人之間的情感取得能量，這是一種照顧貢獻的能量，讓人、事、物都成長的力量。'
      ],
      'advantage_title': '太陰優勢',
      'advantage': '多才多藝，外柔內剛重感情，當心中有決定時絕不退縮，適應力強身段柔軟。',
      'disadvantage_title': '太陰缺點',
      'disadvantage': '晴時多雨偶陣雨，猶豫不決想得多，什麼都懂不專精，情緒化造成表現時好時壞。',
      'heart_title': '太陰提升能量的內心對白',
      'heart': [
        '『我懂得運用溫柔和包容的力量，這是專屬自己的靈性特質，感恩上天給的所有機遇，這些機緣都讓生命更加的圓滿，我會用正向積極的態度面對未來』。',
        '２０１６年是太陰二地奔波的一年，認識愈多的人，可以得到最新的訊息及資源，此時要懂得向眾人請教，別人的經驗是寶藏，往往一句提點的話，反而讓自己找到新的機會，整頓好自己的內部團隊，好好依據每個人的專才安排合適的位置，團隊的目標確時執行比畫大餅來得重要，如何訂出施行步驟及時間表，將決定２０１６是否豐收，每個人都要有團隊合作的概念，彼此合作彼此交流是前進最好的方式，最後在２０１６年要好好的調整自身的狀態，大環境變化的速度超過想像，自己更要有如如不動的穩定，才能在多變的市場中，不受影響，低調內斂才是最大的勝利者。'
      ]
    },
    {
      'msg': [
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是紫微與貪狼兩顆星曜的組合。(簡稱紫貪)',
        '命宮是紫貪的人多材多藝，在漫不經心的外表之下，藏著不願意輸給任何人的企圖心，而自己有創造奇蹟與實現願望，愈處在紫貪的能量裡，愈能讓自己豐富想像力的心靈跟上天宇宙作連結。'
      ],
      'advantage_title': '紫貪優勢',
      'advantage': '逢凶化吉，多元人脈，眾人愛戴，手段靈活，善用本身的能量可以讓整個局面完全不同。',
      'disadvantage_title': '紫貪缺點',
      'disadvantage': '坐這山望那山，心情起伏大，性急不耐靜，結果不如預期是因為堅持度不夠。',
      'heart_title': '紫貪提升能量的內心對白',
      'heart': [
        '『我相信自己，這是我個性中權威的本質，天地是自己的遊樂場，我清楚明白如何運用自身的能力去帶領大家玩的更大更好，此刻願意放下自大與傲慢，不只為了自身的慾望而是全體生命，願意勇敢追夢也將會把所有能量累積至最高的正能量，那將是豐富人生的元素，天地將由我而有所不同』。',
        '２０１６年的紫貪在工作領域是重新定位的一年，工作上會面臨到自我定位的調整，調整的當下會感覺到不舒服，可是這樣的調整反而能為自己整合更多的資源，進而改變過往的局面，所以首先找出自己在人生上的使命感，在工作中想要到達什麼樣的目標跟成就，什麼是自己終極的目標？而這樣的目標跟成就需要如何打拚，出發總要有個方向，目標就在２０１６訂定出來，好消息是：２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來帶領團隊更上一層樓的，讓大家凝聚共識，往同一個目標願景前進，是２０１６的重點工程。'
      ]
    },
    {
      'msg': [
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的命宮是天機與太陰兩顆星曜的組合。(簡稱機陰)',
        '命宮是機陰的組合，顯示自己擁有感情、財富、智慧及療癒性的能量，在溫和斯文的外表下，隱藏著超人一等的智慧，持續發揮包容、體貼的力量，這樣的能量足以改變生命層次，人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機、太陰的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '機陰的優勢',
      'advantage': '知識與智慧兼俱，以柔剋剛是強項，隨著環境改變計劃跟行動也迅速跟著調整。',
      'disadvantage_title': '機陰的缺點',
      'disadvantage': '情緒起伏內心戲太多，容易因情緒而影響執行力，易被外在環境所影響。',
      'heart_title': '機陰提升能量的內心對白',
      'heart': [
        '『相信自己的判斷，自己有智慧去面對所有事情的困難，並且給予任何人溫柔和包容，此刻願意和大家一起攜手並進，感恩上天給的所有機遇，用機緣來滋養圓滿的生命』。',
        '２０１６年是機陰再次突破的一年，過往作好的學習、財務、房產計劃，今年是實現的最佳時機，好消息：２０１６年是人脈大幅擴展的一年，這些人脈來自各個行業，統合好將會擁有超過想像的資源，而想要統合這群混雜著龍蛇的團隊，首先要學會判斷機緣，多跟專業人士交流，整合彼此的資訊，相互資源整合，將對雙方都有很大的助益，但若只是惡性競爭，彼此互砍，那將是大輸的局面，因此如何整合大家的力量，建立共同的願景，一起攜手攻下新市場，將是自己最大的任務。'
      ]
    },
    {
      'msg': [
        '天府是紫引牌中的輔佐上相，這張牌擁有穩定、通才、財庫、權勢的特質。',
        '你的命宮是天府獨坐。',
        '命宮是天府獨坐的人有統合各方勢力的能力，當自己這樣作時，眾人也會來協助化解難處，自己有足夠的能力讓既有的領域再提升及產生全新的發展，自己能整合各路新想法及情報，這些新資訊可以讓所有人都攀升到更高的境界。來吧，把內心真正想要的慾望及渴望圖像化，不用擔心期待會落空，擁有的能力絕對可以讓自己過更好的生活。愈處在天府的能量裡，愈能在天地之間取得資源，條件已經俱足，放開腳步，大力向前，這是一種穩定的能量，讓人、事、物都穩定的力量。'
      ],
      'advantage_title': '天府優勢',
      'advantage': '運籌帷幄，穩重踏實，各路英雄齊相聚，得權得利眾人都稱羨。',
      'disadvantage_title': '天府缺點',
      'disadvantage': '固執堅持，個性愛指揮，說得比作得多，欠缺行動力。',
      'heart_title': '天府提升能量的內心對白',
      'heart': [
        '『我將會對任何人貢獻心力，我願帶領大家往更好的境界提升，我接受領導也能領導別人，勇敢追夢的過程也會欣然接受上天給予的任何經驗，那將是豐富人生的元素』。',
        '２０１６年是天府奔波忙碌的一年，過去的模式將會面臨重大的考驗，此時的局面是我不犯別人，別人卻大軍壓境，走出去找到新資源，才有活路，既然要走出去，結隊同行會安全很多，找志同道合的人一起行動，出發前把計劃跟資金都準備好，統合專業人士的意見，一方面聽取建議，一方面也讓自己的專業再提升。在專業性還不夠之時，聽話照作是非常重要的，充分授權給專業人士，甚至請專業人士引薦高端人脈，將可讓自己找到另一條出路。'
      ]
    },
    {
      'msg': [
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '命宮是太陽獨坐的人熱情與付出會讓事件往光明面去發展，自己是所有狀況的核心，積極貢獻的態度一定能化解所有的狀況，太陽的能量具有散發和溫暖的性質，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在太陽星的能量裡，愈能接受到上天持續關愛的能量。'
      ],
      'advantage_title': '太陽獨坐優勢',
      'advantage': '熱情活躍，教化付出，人緣好行動力十足，只要自己想要的，就會努力去達成。',
      'disadvantage_title': '太陽獨坐缺點',
      'disadvantage': '做事三分鐘熱度，願景很美好但過程中變化太多，不如自己預期就放棄。',
      'heart_title': '太陽獨坐提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，我願意放下一切，我是所有狀況的核心，我相信用積極貢獻的態度一定能化解所有的狀況』。',
        '２０１６年是太陽獨坐自我沈澱的一年，事業的部份必須建立系統及ｓｏｐ流程，而目的是把過往藏污納垢的地方，作一次大整頓，只有大家都願意改變，事業的發展才會更上一層樓，因此２０１６是內部大掃除的一年，而想要清潔內部，首先要先改變過去的思維，過往考量的人情包袱、預算限制、團隊氛圍，都必須打破，先有大破的想法，再來產生大立的作法，然後建立團隊文化及責任分配，文化的建立需要長時間的經營，而這樣的文化將以自己的價值觀為核心，２０１６就是找出自己核心價值並且創造文化的一年。'
      ]
    },
    {
      'msg': [
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '破軍是紫引牌中的溼婆神，這張牌擁有權力、消耗、破壞、創造的特質。',
        '你的命宮是武曲與破軍兩顆星曜的組合。(簡稱武破)',
        '命宮是武破的人能力足夠去成就任何的大事，所以的改變都是因自己而起，改變是讓自己去學習成長進而邁向成功之路，改變創造出全新的機緣，謹慎選擇想法及點子將讓自己生命更豐富，自己有能力點石成金，讓原本平凡無奇的計畫變成生意盎然，愈有勇氣告別過去，迎接新的未來，愈能讓生命中所有重要的人都豐盛，愈處在武曲的能量裡，愈能得到創造力及顯化力，這是一種讓所有想法都實現的能量，感恩為此產生的美好結果。'
      ],
      'advantage_title': '武破優勢',
      'advantage': '想法創新，點子多，勇於挑戰傳統，創造全新的局面，時代潮流的創造者。',
      'disadvantage_title': '武破獨坐缺點',
      'disadvantage': '冥頑不靈講不聽，總是要跌個頭破血流，才學會教訓，不見棺材不掉淚的個性。',
      'heart_title': '武破提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，經驗協助自己改變，堅持目標，努力實踐目標來激勵自己，一個全然不同的自己，正在前面等待，擁有清晰而特定的目標人生從此邁向坦途，自己是有行動力的，我重視失敗帶來的學習，因為不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年是武破豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，整合好同業的資源，形成同盟聯邦的概念，因此弟兄們愈多的團隊，在２０１６年勝出的機率會高很多，而這樣的聯盟需要有人來帶領，不用懷疑，就是由自己承擔重任，帶領大家把市場打下來，自己將成為最大的贏家，過程決不輕鬆，卻會創造非常有價值跟收獲的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產的功課，此時是危機入市的好時機，如果都沒接觸過，此時也是很好學習不動產的一年，至於在工作上，明年是加速團隊前進的一年，要讓大家都有利可賺，才是合格的領袖，放下自己的喜好判斷，學會尊重市場，提供市場需要的才是價值。'
      ]
    },
    {
      'msg': [
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '命宮是天同獨坐的人有能力去協調所有人、事、物、情，讓所有人都開心，事都往正向的發展，物都創造最大的價值，情都有疏通的管道，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，愈處在天同的能量裡，愈能在人際之間取得創意，這是一種讓想法及情感流動的能量，感恩為此產生的美好結果。'
      ],
      'advantage_title': '天同獨坐優勢',
      'advantage': '一生運勢逢凶化吉，作風簡單純真，赤子之心和好奇心都是自己最棒的特質。',
      'disadvantage_title': '天同獨坐缺點',
      'disadvantage': '生活白癡遇事不知如何處理，忙碌時很忙碌，慵懶時很慵懶，時間分配是最大弱點。',
      'heart_title': '天同獨坐提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，人生可以一起攜手向前是福報，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年是天同獨坐機會滿滿的一年，首先大環境會為自己創造非常多的機會，不管是新朋友還是資源，２０１６年是深度連結的開始，而整合眾人的力量是最快的成功方程式，跟愈多的成功人士交流，就可以得到最大的知識助力，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，組織團隊，帶領團隊，不用擔心任何人的評論，放手去作，遇到任何困難大家也都會伸出援手來協助，在辛苦忙碌的２０１６年，也要為自己留下個代表作，一個可以改變世代的作品，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是空宮，取對宮紫微與貪狼兩顆星曜的組合(簡稱紫貪)，來論述。',
        '命宮空宮而對宮是紫貪的人多材多藝，在漫不經心的外表之下，藏著不願意輸給任何人的企圖心，而自己有創造奇蹟與實現願望，愈處在紫貪的能量裡，愈能讓自己豐富想像力的心靈跟上天宇宙作連結。'
      ],
      'advantage_title': '命宮空宮而對宮是紫貪優勢',
      'advantage': '逢凶化吉，多元人脈，眾人愛戴，手段靈活，善用本身的能量可以讓整個局面完全不同。',
      'disadvantage_title': '命宮空宮而對宮是紫貪缺點',
      'disadvantage': '坐這山望那山，心情起伏大，性急不耐靜，結果不如預期是因為堅持度不夠。',
      'heart_title': '命宮空宮而對宮是紫貪提升能量的內心對白',
      'heart': [
        '『我相信自己，這是我個性中權威的本質，天地是自己的遊樂場，我清楚明白如何運用自身的能力去帶領大家玩的更大更好，此刻願意放下自大與傲慢，不只為了自身的慾望而是全體生命，願意勇敢追夢也將會把所有能量累積至最高的正能量，那將是豐富人生的元素，天地將由我而有所不同』。',
        '２０１６年對命宮空宮而對宮是紫貪在工作領域是重新定位的一年，工作上會面臨到自我定位的調整，調整的當下會感覺到不舒服，可是這樣的調整反而能為自己整合更多的資源，進而改變過往的局面，所以首先找出自己在人生上的使命感，在工作中想要到達什麼樣的目標跟成就，什麼是自己終極的目標？而這樣的目標跟成就需要如何打拚，出發總要有個方向，目標就在２０１６訂定出來，好消息是：２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來帶領團隊更上一層樓的，讓大家凝聚共識，往同一個目標願景前進，是２０１６的重點工程。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的對宮是天機與太陰兩顆星曜的組合。(簡稱機陰)',
        '命宮空宮而對宮是機陰的組合，顯示自己擁有感情、財富、智慧及療癒性的能量，在溫和斯文的外表下，隱藏著超人一等的智慧，持續發揮包容、體貼的力量，這樣的能量足以改變生命層次，人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機、太陰的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '命宮空宮而對宮是機陰的優勢',
      'advantage': '知識與智慧兼俱，以柔剋剛是強項，隨著環境改變計劃跟行動也迅速跟著調整。',
      'disadvantage_title': '命宮空宮而對宮是機陰的缺點',
      'disadvantage': '情緒起伏內心戲太多，容易因情緒而影響執行力，易被外在環境所影響。',
      'heart_title': '命宮空宮而對宮是機陰提升能量的內心對白',
      'heart': [
        '『相信自己的判斷，自己有智慧去面對所有事情的困難，並且給予任何人溫柔和包容，此刻願意和大家一起攜手並進，感恩上天給的所有機遇，用機緣來滋養圓滿的生命』。',
        '２０１６年命宮空宮而對宮是再次突破的一年，過往作好的學習、財務、房產計劃，今年是實現的最佳時機，好消息：２０１６年是人脈大幅擴展的一年，這些人脈來自各個行業，統合好將會擁有超過想像的資源，而想要統合這群混雜著龍蛇的團隊，首先要學會判斷機緣，多跟專業人士交流，整合彼此的資訊，相互資源整合，將對雙方都有很大的助益，但若只是惡性競爭，彼此互砍，那將是大輸的局面，因此如何整合大家的力量，建立共同的願景，一起攜手攻下新市場，將是自己最大的任務。'
      ]
    },
    {
      'msg': [
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '七殺是紫引牌中的成敗之神，這張牌擁有威嚴、紀律、剛強、變動的特質。',
        '你的命宮是廉貞與七殺兩顆星曜的組合。(簡稱廉七)',
        '命宮是廉七的人是有個堅定的信念，走出去讓自己的人生從此不同，為的不是私慾，而是整個家族更光明的未來，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，這樣的能量會帶領大家走出一片天，創造更多可能性，嚐試各種方法，去體驗多元的人生，精彩豐盛的結果就在自己手上完成。愈處在廉七的能量裡，愈發現自身充滿了幹勁及渴望，再學會各行各業的規則，將讓自己在人生各個領域中脫胎換骨，這是一種制定競爭規則的能量，這樣的能量可以形成規範，規範所有的勢力。'
      ],
      'advantage_title': '廉七優勢',
      'advantage': '敢想敢要敢衝，謀定而後動，靜如處子，動如脫兔，凡自己所想，皆能創造出來。',
      'disadvantage_title': '廉七缺點',
      'disadvantage': '權勢競爭重，你拚我奪衝突難免，堅持己見及有話說不清的行事風格，非常容易讓人誤解。',
      'heart_title': '廉七提升能量的內心對白',
      'heart': [
        '『人生由我開創，承擔任何決定的後果，我將理性的看待所有事，果決、堅持是最大的利器，不畏困難在夢想尚未到手之前決不放手，凡能力所及一定竭盡所能，我注定會有個不凡的人生經驗，我是生命的主人，能主宰人生往想要的方向前進，掌握人生的規則秩序，我的人生將從此不同』。',
        '２０１６年是廉七提升境界的一年，首先過去在各領域的努力，會在２０１６年開花結果，是往下個階段前進的時候了，過去有一群相信自己的人，首先提升大家的能力及承擔力，再讓更多的新朋友一起加入，一小組一小組大家一起前進，必須訂定眾人的目標，如何讓大家步伐一致，發揮最大的戰力，就靠自己居中規範了，要整合協調這樣的團隊，絕非易事，行動力跟執行力都要再加倍，除了大家要責任分擔跟充分授權，團隊的氛圍更重要，士氣凝聚起來，每個人都可以發揮出１００％的戰力了。'
      ]
    },
    {
      'msg': [
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的命宮是天梁獨坐。',
        '命宮是天梁獨坐的人擁有教化貢獻的能量，自己成熟的想法、穩定踏實的作法，不論是跟自己有關係的親朋好友或沒關係的民眾，自己總是願意貢獻所長讓對方更好。自己有能力可以提升對方到另一個層次，專注聆聽每個人內在的小聲音，會很清楚知道對方需要什麼樣的建議，自己就有這樣神奇的力量。愈處在天梁的能量裡，愈發現自己擁有敦厚、仁慈的特質，這是一種照顧的能量，讓身、心、靈都愉悅的力量。'
      ],
      'advantage_title': '天梁優勢',
      'advantage': '黑白分明有原則，急公好義好熱心，一步一腳印務實的走下一步。',
      'disadvantage_title': '天梁缺點',
      'disadvantage': '堅持己見有理說不清，好為人師愛嘮叨，管太多總讓人感到不舒服。',
      'heart_title': '天梁提升能量的內心對白',
      'heart': [
        '『我聆聽內在最深的聲音，清楚知道為何而作，深知自己有治癒任何人的能力，能力所及一定竭盡所能，我注定會有個不凡的人生，我總知道哪一條是正確的道路，我！相信自己！』。',
        '２０１６年是天梁充份發揮的一年，工作上有非常多的機會產生，人跟人之間的交流，上下整合左右合作，可以創造出更多的契機，好的機會跟點子，需要計劃來執行，人與人交流也需要有個方向來討論，當所有人都到對的位置，所以事都照時間執行，所以物都歸定位，豐盛美好的果實只是伴隨而來的結果，而這最關鍵的是：賞罰分明制度的建立，這是自己擅長的強項，只是必須破除舊有的框架，以現行環境及狀況量身訂作，這樣系統制度是決定２０１６成敗的關鍵點，自己要在這個地方多用心。'
      ]
    },
    {
      'msg': [
        '天相是紫引牌中的協調之神，這張牌擁有盡責、福善、面子、隨和的特質。',
        '你的命宮是天相獨坐。',
        '命宮是天相獨坐的人擁有調節雙方連結的能量，自己能調節兩邊的落差使其平衡，不論是有形的物品、資產或無形的思想、能量，自己總是可以讓雙方連結起來進而交流互動。找尋這些訊息與自己之間的相關性或共通性，它們將是實現目標的引導，愈能有意識的察覺這些神奇的能量，愈能讓夢想在現實中實現出來。愈處在天相的能量裡，愈發現所有的資源及能量都透過自己而互相交流，這是一種能量調節的權力，讓人、事、物都平衡圓滿的力量。'
      ],
      'advantage_title': '天相優勢',
      'advantage': '身段靈活，感受力同理心強，一生資源不斷，連結雙方資源是自己最好的本事。',
      'disadvantage_title': '天相缺點',
      'disadvantage': '面面俱到兩邊不討好，公親變事主是非多，承攬別人的問題變成自己的問題。',
      'heart_title': '天相提升能量的內心對白',
      'heart': [
        '『我以樂觀的態度和信心協調所有的人、事、物，讓每個人、事、物都在每個位置發揮出最大的價值，我有能力居中調度，而這也將是我自身最大的價值』。',
        '２０１６年是天相整合理念的一年，認識愈多的人，可以得到更多的訊息及資源，此時要懂得向眾人學習，別人是鏡子更是導師，往往一句無心的話，反而讓自己找到新的機會，整合自己的人際關係，好好分辨哪些人值得深入交往，人脈連結的深度比廣度還來得重要，大家雖然想法不同，良性互動是切磋，討論出更好的想法對大家都好。而在團隊中，更要培養自己的接班人，給對方全面性的訓練，讓他可以成為自己有力的臂膀，最後在２０１６年要好好的調整自身的想法，大環境變化的速度超過想像，永遠接受最新的觀念，才能主導市場的脈絡，誰創造出市場需求，誰就是最大的贏家。'
      ]
    },
    {
      'msg': [
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的命宮是巨門獨坐。',
        '命宮是巨門獨坐的人擁有內外連結的能量，自己能觀察到所有人外部行為想表達的內在聲音，或許是透過物品、事件、聲音或行為，自己總是可以連結到對方內在沒有表達出來的真正想法。找尋這些訊息與自己之間的相關性或共通性，它們將是實現目標的引導，調整好自己的狀態，自己將更有效的利用時間、金錢跟資源。愈處在巨門的能量裡，愈能把身邊凌亂的狀態去除，這是一種化繁為簡的能量，讓人、事、物都展現價值的力量。'
      ],
      'advantage_title': '巨門優勢',
      'advantage': '冷靜理性，敏銳觀察力強，腦筋靈活反應快，一生資源不斷，口才表達是自己最好的本事。',
      'disadvantage_title': '巨門缺點',
      'disadvantage': '疑心重，有話不說清楚，非常容易造成別人的誤解，心直口快容易禍從口出。',
      'heart_title': '巨門提升能量的內心對白',
      'heart': [
        '『以肯定的話語給出承諾，凡我承諾一定達成，天地之間必來協助，自己的話語是有力量的，這樣的力量影響著天地萬物，我必把這股力量用在提升所有人的生活品質』。',
        '２０１６年是巨門內部整合出去取經的一年，整頓好自己的內部團隊，好好依據每個人的專才安排合適的位置，團隊的目標確時執行比畫大餅來得重要，團隊有共識之後，一起走出去跟各行各業的人交流，可以得到最新的訊息及資源，此時要懂得向眾人請教，別人的經驗是寶藏，往往一句提點的話，反而讓自己找到新的機會，如何訂出施行步驟及時間表，將決定２０１６是否豐收，每個人都要有團隊合作的概念，彼此合作彼此交流是前進最好的方式，最後在２０１６年要好好的調整自身的狀態，大環境變化的速度超過想像，自己更要加強行動力跟執行力，作過去同樣的事，只會產生同樣的結果，只有走一條不同的路，才會有不同的結果發生，２０１６就去冒險吧。'
      ]
    },
    {
      'msg': [
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '天相是紫引牌中的協調之神，這張牌擁有盡責、福善、面子、隨和的特質。',
        '你的命宮是紫微與天相兩顆星曜的組合。(簡稱紫相)',
        '命宮是紫相的人身段柔軟，在隨和面面俱到的外表之下，藏著不願意輸給任何人的企圖心，而自己是個得天獨厚的人，所有的資源及能量都透過自己而交流，愈處在紫相的能量裡，愈能讓自己內在渴望的願景透過眾人的協助而實現出來。'
      ],
      'advantage_title': '紫相優勢',
      'advantage': '剛柔並濟，資源豐富，透過人脈的連結，可以為自己取得更高更棒的資源，透過自己的整合，資源可以發揮更大的價值。',
      'disadvantage_title': '紫相缺點',
      'disadvantage': '面面兼顧，疲於奔命，太過在乎自身的利益反而公親變事主，二邊都不討好。',
      'heart_title': '紫相提升能量的內心對白',
      'heart': [
        '『我相信自己，這是個性中權威的本質，會以樂觀的態度和信心協調所有的人、事、物，讓每個人、事、物都在自身的位置發揮出最大的價值，此刻願意放下自大與傲慢，考量的不只是自身的慾望而是眾人最大的利益，願意承擔責任也將會把所有能量發揮到正確的位置，有能力去平衡及分配所有人事的位置和資源，結果將因自己而有所不同』。',
        '２０１６年的紫相在工作領域是重新定位的一年，工作上會面臨到階段性的調整，調整的當下會感覺不舒服，而這樣的調整是重新定調團隊的位置及任務（包括自己），所以首先找出自己在事業上的定位，在工作中可以貢獻什麼樣的資源及力量，什麼是要取捨的？而到達目標跟成就又需要整合多少的力量跟聲音，利用２０１６整合出來，好消息是：２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來協助自己統合資源的，切勿跟這樣的力量相競爭，競爭只是減弱彼此的力量，合作才能開創全新的局面，以自身為核心進行交流進而整合，創造出各領域都多贏的局面。'
      ]
    },
    {
      'msg': [
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的命宮是天機與巨門兩顆星曜的組合。(簡稱機巨)',
        '命宮機巨的組合，顯示自己擁有內外資訊整合的能力，找尋這些訊息之間的相關性與共通性，在溫和斯文的外表下，隱藏著超人一等的智慧，持續發揮包容、體貼的力量，這樣的能量足以改變生命層次，人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機、太陰的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '機巨的優勢',
      'advantage': '聰明內斂想得深，計劃周延全兼顧，資源透過人脈交流溝通整合到自己身上。',
      'disadvantage_title': '機巨的缺點',
      'disadvantage': '機關算盡想太多，別人不易收到自己想溝通的，自己為難自己，反而困住自己。',
      'heart_title': '機巨提升能量的內心對白',
      'heart': [
        '『以肯定正面的話語跟所有人、事溝通，相信自己的判斷有智慧去面對所有事情的困難，凡我承諾一定達成，宣告的願景，天地萬物必來助我一臂之力，感恩上天給的所有機遇，用機緣來滋養圓滿的生命』。',
        '２０１６年是機巨再次突破的一年，過往累積出來的物資及人際關係，今年是多元整合的最佳時機，外地各方的機會源源不絕，只要自己願意嚐試就有一定的成績，要讓這些機會創造更美好的結果，首先要注意法規及市場觀感的問題，游走在法律邊緣及忽視大眾的感受，最後會讓自己得不償失，因此多元整合，以大眾利益為利益，將幫助自己建立長治久安的局面。'
      ]
    },
    {
      'msg': [
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是貪狼獨坐。',
        '命宮是貪狼獨坐的人擁有的是全世界最強大的任何能量，自己能喜悅的去創造奇蹟與實現願望，愈是輕鬆的態度愈能為自己開創全新的局面。雖然狀況很多讓自己非常忙碌，不過自己非常清楚當下的每個位置，自己擁有足夠的能力去改變所有的遊戲規則，本身多才多藝，學習力強，應變快，善念將造福所有人讓局面多贏，天賦才華用在哪裡，哪裡就得到成就。愈處在貪狼的能量裡，愈能在天地之間取得能量，這是一種豐富多元的能量，讓人、事、物都提升境界的力量。'
      ],
      'advantage_title': '貪狼優勢',
      'advantage': '多才多藝，個性積極不放棄，多變靈活，堅持前進，不達目標絕不停止。',
      'disadvantage_title': '貪狼缺點',
      'disadvantage': '性急好動沒耐心，坐這山望那山不滿足，改來變去給人感覺高度的不定性。',
      'heart_title': '貪狼提升能量的內心對白',
      'heart': [
        '『我清楚明白如何可以讓所有人都變的更好，我不只為了自身的慾望而是全體生命，如此天地將是自己的遊樂場，我將會把所有能量累積至最高的正能量，天地將因自己而有所不同』。',
        '２０１６年是貪狼暗下功夫的一年，過去自己專精的才能，已經不符合現在市場需求了，歸零心態再次的學習，透過跟不同的人交流，既可以找到合作的夥伴，也可以教學相長，因此廣泛的在學習場所認識人，對自己會很有幫助，整個２０１６年讓自己去找到一個可以下功夫的市場，想在人前風光，台下十年的功夫少不了，蹲低是為了可以跳更高，２０１６年是很重要的基礎工程，未來的高樓就從今年開始。'
      ]
    },
    {
      'msg': [
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的命宮是太陽與太陰兩顆星曜的組合。(簡稱日月)',
        '命宮是日月的人既溫柔且熱情，既重面子又重裡子，自己是所有狀況的核心，擁有感情、財富、機緣及療癒性的能量，積極貢獻的態度能化解所有的狀況，日月的能量具有給予熱情和全世界最強大的溫柔能量，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在日月的能量裡，愈能改變生命中所有人的層次。'
      ],
      'advantage_title': '日月優勢',
      'advantage': '既柔且剛，有聆聽的能力，也有落實的實力，人緣連結能力強，能為自己開創任何的可能性。',
      'disadvantage_title': '日月缺點',
      'disadvantage': '陰晴不定，一下晴天一下雨，情緒控管不了，容易因情緒而壞事，耐心毅力都不足。',
      'heart_title': '日月提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，這是大家給予我的溫柔和包容，我願意放下一切，我是所有狀況的核心，感恩上天給的所有機遇，我相信用積極貢獻的態度一定能化解所有的狀況並滋養所有圓滿的生命』。',
        '２０１６年是日月自我定位的一年，找出自己內心深藏的渴望及害怕，面對才能接受，接受再來改變，而事業的部份必須建立新系統及流程，而目的是把過往不合時宜的作法，作一次大整頓，只有大家都願意合作，事業的發展才會更上一層樓，因此２０１６是內部大調整的一年，而想要調整內部，首先要先改變過去的思維，過往考量的人情包袱、規則限制，都必須打破，先有大破的想法，再來產生大立的作法，然後建立團隊文化及方向，文化的建立需要長時間的經營，而方向的確立將以自己的價值觀為核心，２０１６就是為團隊訂出方向並且創造文化的一年。'
      ]
    },
    {
      'msg': [
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '天府是紫引牌中的輔佐上相，這張牌擁有穩定、通才、財庫、權勢的特質。',
        '你的命宮是武曲與天府兩顆星曜的組合。(簡稱武府)',
        '命宮是武府的人能力足夠去統合各方勢力進而成就任何的大事，所以的改變都是因自己而起，改變是讓自己現在的領域有新的發展及提升，創造出全新的機緣，謹慎選擇想法及點子將讓自己生命更豐富，自己有能力點石成金，讓原本平凡無奇的計畫變成生意盎然，放心！願景會實現出來的，自己有能力過更好的生活，愈處在武府的能量裡，愈能得到資源及顯化力，這是一種讓資產重分配的能量，放手去實現更美好的結果。'
      ],
      'advantage_title': '武府優勢',
      'advantage': '穩重踏實，理想與現實兼顧，一步一腳印往夢想前進，堅持到所以人都認同。',
      'disadvantage_title': '武府缺點',
      'disadvantage': '靈活度不足，頤指氣使，結黨營私，給人只顧自身的權益，容易讓人心生不滿。',
      'heart_title': '武府提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，經驗協助自己改變，堅持目標，努力實踐目標來激勵自己，我能帶領大家往更好的境界提升，接受別人領導也能領導別人，勇敢追夢也會欣然接受上天給予的任何考驗，自己是有行動力的，我重視失敗帶來的學習，因為不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年是武府豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，整合好同業的資源，形成同盟聯邦的概念，因此資源愈多的團隊，將在２０１６年勝出，而這樣的資源需要大家一起來創造，如何讓每個人都到位，是自己最重要的工程，帶領大家把市場打下來，自己將成為最大的贏家，過程決不輕鬆，卻會創造非常有價值跟收獲的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產的功課，此時是危機入市的好時機，如果都沒接觸過，此時也是很好學習不動產的一年，至於在工作上，明年是加速團隊前進的一年，充分溝通及授權是必要的，只有信任夥伴，夥伴才會為自己帶來豐盛的成果。'
      ]
    },
    {
      'msg': [
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '命宮是天同獨坐的人有能力去協調所有人、事、物、情，讓所有人都開心，事都往正向的發展，物都創造最大的價值，情都有疏通的管道，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，愈處在天同的能量裡，愈能在人際之間取得創意，這是一種讓想法及情感流動的能量，感恩為此產生的美好結果。'
      ],
      'advantage_title': '天同獨坐優勢',
      'advantage': '一生運勢逢凶化吉，作風簡單純真，赤子之心和好奇心都是自己最棒的特質。',
      'disadvantage_title': '天同獨坐缺點',
      'disadvantage': '生活白癡遇事不知如何處理，忙碌時很忙碌，慵懶時很慵懶，時間分配是最大弱點。',
      'heart_title': '天同獨坐提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，人生可以一起攜手向前是福報，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年是天同獨坐機會滿滿的一年，首先大環境會為自己創造非常多的機會，不管是新朋友還是資源，２０１６年是物資連結的開始，而整合眾人的團隊是最快的達標方程式，跟愈多的精英團隊交流，就可以得到最多的資訊及消息，而掌握最新的訊息將讓自己立於不敗之地，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，打開彼此的心結，充分溝通並取得眾人的共識，就讓自己放手去作，遇到任何困難大家也都會給出建議來協助，在辛苦忙碌的２０１６年，也要為自己留下個代表作，一個可以改變產業結構的作品，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '破軍是紫引牌中的溼婆神，這張牌擁有權力、消耗、破壞、創造的特質。',
        '你的命宮是破軍獨坐。',
        '命宮是破軍獨坐的人擁有重生的能量，自己有十足的堅持力跟創意，只要立下目標，不管要付出什麼代價，一定讓目標實現，自己決不放棄，自己是堅強的創造者，領導著整個團隊往前，挫折是成功的過程，改變是讓自己去學習成長進而讓自己邁向成功之路，改變創造出全新的機緣，勇敢接受並面對，自己每一步都是走向光明的未來。愈處在破軍的能量裡，愈有勇氣告別過去，迎接新的未來，這是一種狀態改變的能量，讓大家都進化的力量。'
      ],
      'advantage_title': '破軍優勢',
      'advantage': '創意改革、堅持突破，為了心中的理念，不惜花費任何代價，都要實現。',
      'disadvantage_title': '破軍缺點',
      'disadvantage': '消耗自己同時也把身邊人的能量消耗光，任何代價是用在乎自己的人去付的。',
      'heart_title': '破軍提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，我讓經驗來協助改變，一個全然不同的自己，正在前面等待著，自己走的路，自己開創，我要走一條所有人都沒走過的路』。',
        '２０１６年是破軍動用關係的一年，過去的人際關係將會面臨重大的考驗，此時正是提升自我專業最好的時間點，向上位者或長輩請教，他們擁有自己沒有的經驗跟人脈，虛心請教將可得到預料之外的協助，可經證實成功的模式、系統或建議會是很好的參考。整合自己的人際關係，好好分辨哪些團隊可以產生理念跟價值，人脈連結的深度比廣度還來得重要，２０１６年第一：要好好的控管自身的情緒（包括感情），無法讓自己更好的情緒，請馬上放下，當下轉念是２０１６要練的本事。第二：內部的支援系統要建立起來，要能應付連結的上層能量，如此才能產生豐盛的結果。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的對宮是天機與巨門兩顆星曜的組合。(簡稱機巨)',
        '命宮空宮而對宮是機巨的組合，顯示自己擁有內外資訊整合的能力，找尋這些訊息之間的相關性與共通性，在溫和斯文的外表下，隱藏著超人一等的智慧，持續發揮包容、體貼的力量，這樣的能量足以改變生命層次，人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機、太陰的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '命宮空宮而對宮是機巨的優勢',
      'advantage': '聰明內斂想得深，計劃周延全兼顧，資源透過人脈交流溝通整合到自己身上。',
      'disadvantage_title': '命宮空宮而對宮是機巨的缺點',
      'disadvantage': '機關算盡想太多，別人不易收到自己想溝通的，自己為難自己，反而困住自己。',
      'heart_title': '命宮空宮而對宮是機巨提升能量的內心對白',
      'heart': [
        '『以肯定正面的話語跟所有人、事溝通，相信自己的判斷有智慧去面對所有事情的困難，凡我承諾一定達成，宣告的願景，天地萬物必來助我一臂之力，感恩上天給的所有機遇，用機緣來滋養圓滿的生命』。',
        '２０１６年命宮空宮而對宮是機巨再次突破的一年，過往累積出來的物資及人際關係，今年是多元整合的最佳時機，外地各方的機會源源不絕，只要自己願意嚐試就有一定的成績，要讓這些機會創造更美好的結果，首先要注意法規及市場觀感的問題，游走在法律邊緣及忽視大眾的感受，最後會讓自己得不償失，因此多元整合，以大眾利益為利益，將幫助自己建立長治久安的局面。'
      ]
    },
    {
      'msg': [
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '你的命宮是廉貞獨坐。',
        '命宮是廉貞獨坐的人是有個堅定的信念，這樣的信念需要冒險及探索才能實現，待在自己的舒適圈雖然可以感到安心與放心，但走出舒適圈並擴大舒適圈能讓人生更舒適，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，這樣的堅持會讓自己走出一片天，創造更多可能性，嚐試各種方法，去體驗多元的人生，精彩豐盛的結果就在自己手上完成。愈處在廉貞的能量裡，愈能在天地之間找出規則，這樣的規則可以讓各個領域的人都脫胎換骨，這是一種定義真理的能量，這樣的能量可以形成信念，分辨對與錯的信念。'
      ],
      'advantage_title': '廉貞優勢',
      'advantage': '運籌帷幄，謀定而後動，十八套劇本任何狀況難不倒，凡自己所想，皆能創造出來。',
      'disadvantage_title': '廉貞缺點',
      'disadvantage': '重視細節，吹毛求疵，自己把自己困住，也要把所有人都困住。',
      'heart_title': '廉貞提升能量的內心對白',
      'heart': [
        '『人生由我開創，承擔任何決定的後果，把所有的人、事、物規劃好是最大的利器，不畏困難在夢想尚未到手之前堅持不懈，不管能力作不作的到都要盡全力達標，我是生命的主人，能主宰人生的方向，主掌人生的規則秩序，我的生命跟任何人都不同』。',
        '２０１６年是廉貞提升境界的一年，過去的努力，將會在２０１６年開花結果，這不是結束而是另一個開始，首先再提升自我控制能力及承擔力，如此才能整合更多的資源及機會，人傳人的宣傳是最有效果的，想要有這樣的機會跟效果，現有團隊的重組是必要的，開放可能性讓更多元的人進來，讓團隊彼此良性競爭產生正向的能量，自己觀察每個人的屬性及說話的方式，什麼人跟什麼人搭檔可以產生最大的產值由自己來決定，哪個小組主推什麼樣的產品線也由自己分配，垂直整合及橫向合作將讓所有參與者都可以打下一片天，這樣的結果，自己將在２０１６年完成。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的對宮是太陽與太陰兩顆星曜的組合。(簡稱日月)',
        '命宮空宮而對宮是日月的人既溫柔且熱情，既重面子又重裡子，自己是所有狀況的核心，擁有感情、財富、機緣及療癒性的能量，積極貢獻的態度能化解所有的狀況，日月的能量具有給予熱情和全世界最強大的溫柔能量，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在日月的能量裡，愈能改變生命中所有人的層次。'
      ],
      'advantage_title': '命宮空宮而對宮是日月優勢',
      'advantage': '既柔且剛，有聆聽的能力，也有落實的實力，人緣連結能力強，能為自己開創任何的可能性。',
      'disadvantage_title': '命宮空宮而對宮是日月缺點',
      'disadvantage': '陰晴不定，一下晴天一下雨，情緒控管不了，容易因情緒而壞事，耐心毅力都不足。',
      'heart_title': '命宮空宮而對宮是日月提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，這是大家給予我的溫柔和包容，我願意放下一切，我是所有狀況的核心，感恩上天給的所有機遇，我相信用積極貢獻的態度一定能化解所有的狀況並滋養所有圓滿的生命』。',
        '２０１６年命宮空宮而對宮是日月自我定位的一年，找出自己內心深藏的渴望及害怕，面對才能接受，接受再來改變，而事業的部份必須建立新系統及流程，而目的是把過往不合時宜的作法，作一次大整頓，只有大家都願意合作，事業的發展才會更上一層樓，因此２０１６是內部大調整的一年，而想要調整內部，首先要先改變過去的思維，過往考量的人情包袱、規則限制，都必須打破，先有大破的想法，再來產生大立的作法，然後建立團隊文化及方向，文化的建立需要長時間的經營，而方向的確立將以自己的價值觀為核心，２０１６就是為團隊訂出方向並且創造文化的一年。'
      ]
    },
    {
      'msg': [
        '七殺是紫引牌中的成敗之神，這張牌擁有威嚴、紀律、剛強、變動的特質。',
        '你的命宮是七殺獨坐。',
        '命宮是七殺獨坐的人擁有決戰第一線的能量，自己十足的執行力跟行動力，只要訂下任務，不管多艱辛困難，一定讓自己使命必達，自己總是衝第一，為的不是自己的私慾，而是團隊所有人更光明的未來，自己是勇敢的領導者，領導著整個團隊往前，挫折會成為未來成功的墊腳石，勇敢跨出每一步，每一步都是光明的未來。愈處在七殺的能量裡，愈發現充滿了幹勁及渴望，這是一種突破現況的能量，讓大家都前進的力量。'
      ],
      'advantage_title': '七殺優勢',
      'advantage': '耐操好用拚第一，積極果斷不遲疑，目標明顯一路前行不怕苦不怕難。',
      'disadvantage_title': '七殺缺點',
      'disadvantage': '衝動行事好後悔，一將功成萬骨枯，再回頭已百年身，容易給人踩著別人肩膀往上爬的感覺。',
      'heart_title': '七殺提升能量的內心對白',
      'heart': [
        '『人生由我開創，承擔任何的決定，我將理性的看待所有事，果決、堅持是自己最大的利器，不畏困難在夢想尚未到手之前，自己絕不放手』。',
        '２０１６年是七殺再起戰役的一年，人生觀相同才能成為戰友，人脈要能合作才叫人脈，認識愈多的人，才能從中找到知己同好，想要組織一個有戰力的隊伍，廣泛認識人，對自己會很有幫助，而想要讓別人認同，必須有自己的代表作，一個能表達自己理念及人生觀的作表作，在整個２０１６年，自己必須去完成這樣的作品，另外在事業上，也必須要有作戰的盟友，盟軍不用多，精兵反而好整合，交流彼此的想法，資源互相交換，有共同的目標及願景，市場很大，這樣的陣容什麼都能拿到，但先在某個領域作到位，反而會建立聲勢，當受到大家的矚目之後，其餘的市場再慢慢打。'
      ]
    },
    {
      'msg': [
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的命宮是天梁獨坐。',
        '命宮是天梁獨坐的人擁有教化貢獻的能量，自己成熟的想法、穩定踏實的作法，不論是跟自己有關係的親朋好友或沒關係的民眾，自己總是願意貢獻所長讓對方更好。自己有能力可以提升對方到另一個層次，專注聆聽每個人內在的小聲音，會很清楚知道對方需要什麼樣的建議，自己就有這樣神奇的力量。愈處在天梁的能量裡，愈發現自己擁有敦厚、仁慈的特質，這是一種照顧的能量，讓身、心、靈都愉悅的力量。'
      ],
      'advantage_title': '天梁優勢',
      'advantage': '黑白分明有原則，急公好義好熱心，一步一腳印務實的走下一步。',
      'disadvantage_title': '天梁缺點',
      'disadvantage': '堅持己見有理說不清，好為人師愛嘮叨，管太多總讓人感到不舒服。',
      'heart_title': '天梁提升能量的內心對白',
      'heart': [
        '『我聆聽內在最深的聲音，清楚知道為何而作，深知自己有治癒任何人的能力，能力所及一定竭盡所能，我注定會有個不凡的人生，我總知道哪一條是正確的道路，我！相信自己！』。',
        '２０１６年是天梁家和萬事興的一年，整頓好自己的內部團隊（包括家庭），好好依據每個人的專才安排合適的位置，團隊的目標確時執行比畫大餅來得重要，團隊有共識之後，一起跟各行各業的人交流，得到的最新訊息及資源要懂得大家一起討論，別人的想法是寶藏，彼此不同的觀點，反而讓自己找到新的機會，如何訂出施行步驟及時間表，將決定２０１６是否豐收，每個人都要有團隊合作的概念，彼此合作彼此交流是前進最好的方式，最後在２０１６年要好好的調整自身的狀態，大環境變化的速度超過想像，自己更要關注團隊是否走在軌道上，作對事情，也要方向是對的，才能走到目標，２０１６大家一起來創造豐盛。'
      ]
    },
    {
      'msg': [
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '七殺是紫引牌中的成敗之神，這張牌擁有威嚴、紀律、剛強、變動的特質。',
        '你的命宮是紫微與七殺兩顆星曜的組合。(簡稱紫七)',
        '命宮是紫七的人認真拚命，在嚴肅不易親近的外表之下，藏著不願意輸給任何人的企圖心，自己有個堅定的信念：讓自己走出去，創造出一個與眾不同的人生，愈處在紫七的能量裡，愈發現自身充滿了幹勁及渴望，身先士卒總能開創出許多的機會。'
      ],
      'advantage_title': '紫七優勢',
      'advantage': '執行力一流，敢想敢要，作好決定之後，無論如何都會讓自己走到目的地，適時調整能力很強，遇強勁的對手更能激發能力出來。',
      'disadvantage_title': '紫七缺點',
      'disadvantage': '就事論事，鐵面無情，沒耐心停下腳步等落後的隊員，容易招致薄情寡性的批評。',
      'heart_title': '紫七提升能量的內心對白',
      'heart': [
        '『我相信自己，這是個性中權威的本質，人生由自己開創，願承擔所有的決定，將理性的看待所有事，果決、堅持是最大的利器，此刻願意放下自大與傲慢，為的不是自己的私慾，而是整個家族更光明的未來，自己就是領導者，領導著整個家族往前，在夢想未實現之前決不放手』。',
        '２０１６年的紫相在工作領域是重新定位的一年，工作上會面臨到破壞性的調整，調整的當下會感覺不舒服，而這樣的調整是把過往既有的框架打掉並且要重新建設，所以首先找出自己在事業上的定位，調整自己的心情，把過往在各領域學到的知識和認識的人脈，什麼是可以整合的？而到達目標跟成就又需要整合多少的資源跟花費多少時間，利用２０１６把大框架訂出來，好消息是：在２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來協助自己建立系統的，切勿跟這樣的力量相競爭，競爭只是減弱彼此的力量，合作才能開創全新的局面，系統的建立是讓自己可以抽身發展其他領域，進而創造出各領域都多贏的局面。'
      ]
    },
    {
      'msg': [
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的命宮是天機與天梁兩顆星曜的組合。(簡稱機梁)',
        '命宮機梁的組合，顯示自己擁有心靈提升的能力，發揮智慧，讓自己身邊的所有人可以提升到更高的層次，清楚內心真正想要的是什麼，不急不徐的態度一定能實現所有的狀況，人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在機梁的能量裡，愈能接受上天給予的際遇。'
      ],
      'advantage_title': '機梁的優勢',
      'advantage': '聰明忠厚有原則，行事穩重，懂得整合新舊之間的力量，讓自己更有能量與能力應付所有狀況。',
      'disadvantage_title': '機梁的缺點',
      'disadvantage': '規則制度綁手腳，顧慮東顧慮西，讓自已無法前進，計劃周全不執行還是停在原地而已。',
      'heart_title': '機梁提升能量的內心對白',
      'heart': [
        '『我深知自己是個有治癒能力的人，我相信自己的判斷，我有智慧去面對所有事情的困難，凡我能力所及一定竭盡所能，我注定會有個不凡的人生經驗，聆聽內在最深的聲音，而祂總會讓自己知道一條正確的道路，此刻我願意和大家一起攜手並進，一起學習每件事情的精髓』。',
        '２０１６年是機梁再次突破的一年，過往學習的各方知識及道理，今年要確實執行看到成果，外地各方的機會及資金源源不絕，只要自己願意嚐試就有一定的成績，目前天時地利都已經來到，要讓這些機會創造更美好的結果，最關鍵的是『人和』問題，如何打破彼此的框架，開放所有的可能性，多元化整合，讓所以人都有利益，將是２０１６重要的革命工程。'
      ]
    },
    {
      'msg': [
        '天相是紫引牌中的協調之神，這張牌擁有盡責、福善、面子、隨和的特質。',
        '你的命宮是天相獨坐。',
        '命宮是天相獨坐的人擁有調節雙方連結的能量，自己能調節兩邊的落差使其平衡，不論是有形的物品、資產或無形的思想、能量，自己總是可以讓雙方連結起來進而交流互動。找尋這些訊息與自己之間的相關性或共通性，它們將是實現目標的引導，愈能有意識的察覺這些神奇的能量，愈能讓夢想在現實中實現出來。愈處在天相的能量裡，愈發現所有的資源及能量都透過自己而互相交流，這是一種能量調節的權力，讓人、事、物都平衡圓滿的力量。'
      ],
      'advantage_title': '天相優勢',
      'advantage': '身段靈活，感受力同理心強，一生資源不斷，連結雙方資源是自己最好的本事。',
      'disadvantage_title': '天相缺點',
      'disadvantage': '面面俱到兩邊不討好，公親變事主是非多，承攬別人的問題變成自己的問題。',
      'heart_title': '天相提升能量的內心對白',
      'heart': [
        '『我以樂觀的態度和信心協調所有的人、事、物，讓每個人、事、物都在每個位置發揮出最大的價值，我有能力居中調度，而這也將是我自身最大的價值』。',
        '２０１６年是天相強硬改變的一年，過去的模式將會面臨重大的考驗，此時的局面是我不犯別人，別人卻大軍壓境，不想坐以待斃，生活方式照別人的規則，那就走出去找到新資源，如此才有活路，既然要出去，結隊同行會安全很多，找志同道合的人一起行動，出發前把計劃跟資金都準備好，統合專業人士的意見，一方面聽取建議，一方面也讓自己的專業再提升。在專業性還不夠之時，規則化的執行跟聽話照作是非常重要的，相信並授權給專業人士，甚至請專業人士找出自己的茫點，進行改造，將可讓自己找到另一條出路。'
      ]
    },
    {
      'msg': [
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的命宮是太陽與巨門兩顆星曜的組合。(簡稱日巨)',
        '命宮是日巨的人既內斂且熱情，為了想在人前風光，願意花時間培養自己的實力，認真尋找外面訊息與自己之間的相關性與共通性，它們將是實現目標的引導。自己是所有狀況的核心，花一點時間把身邊凌亂的狀態去除，如此將會提升自信心與能量，啟動深藏在內的能量，日巨的能量具有給予熱情和整合資產並帶動市場的能量，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在日巨的能量裡，愈能改變生命中所有人的環境。'
      ],
      'advantage_title': '日巨優勢',
      'advantage': '既柔且剛，有聚集資產的能力，也有帶動潮流的實力，人緣再連結資源能力強，敢為自己開創任何的可能性。',
      'disadvantage_title': '日巨缺點',
      'disadvantage': '話說太快，承諾給出去之後發現事情不如預期，容易因環境變化而放棄，堅持跟執行力都不足。',
      'heart_title': '日巨提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，以肯定的話語跟天地之間溝通，凡我承諾一定達成，只要我願意宣告我的願景，天地萬物必來助我一臂之力我願意放下一切，我是所有狀況的核心，感恩上天給的所有機遇，我相信用積極貢獻的態度一定能化解所有的狀況』。',
        '２０１６年是日巨自我定位的一年，找出自己內心深藏的渴望及害怕，過去消耗太多的時間跟體力在無謂的堅持上面，改變堅持的目標，將讓自己有個全然不同的樣貌，而事業的部份必須建立新系統及流程，而目的是把過往傳統管理的作法，作一次大整頓，只有大家都願意調整位置及心態，事業的發展才會更上一層樓，因此２０１６是內部人事變動的一年，而想要調整內部，首先要先改變過去的規範，過往考量的人情包袱、規則限制，都必須打破，先有大破的想法，再來制定重生的作法，然後建立團隊文化及價值，文化的建立需要長時間的經營，而價值的建立將以自己為核心來發展，２０１６就是團隊共同建立價值的一年。'
      ]
    },
    {
      'msg': [
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是武曲與貪狼兩顆星曜的組合。(簡稱武貪)',
        '命宮是武貪的人擁有喜悅能力去創造奇蹟與實現願望，展現輕鬆的態度能開創全新的局面。本身是非常有才華及能力的人，可以改變陳舊的常規，善念可以造福所有人讓局面雙贏，謹慎選擇想法及點子將讓自己生命更豐富，自己有能力點石成金，讓原本平凡無奇的計畫變成精彩又豐盛，放心！願景會實現出來的，自己有能力創造更精彩的生命，愈處在武貪的能量裡，愈能得到人際資源及顯化力，這是一種讓資源槓桿的能量，放手去實現更美好的結果。'
      ],
      'advantage_title': '武貪優勢',
      'advantage': '既柔且剛，身段柔軟內心堅持，輕鬆與剛硬兼顧，各式自樣的資源及人脈，都可以整合到身邊。',
      'disadvantage_title': '武貪缺點',
      'disadvantage': '內外落差大，忽冷忽熱，給人表裡不一，行事風格容易讓人誤解。',
      'heart_title': '武貪提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，經驗協助自己改變，堅持目標，努力實踐目標來激勵自己，我將把所有能量累積至最高的正能量，天地將因自己而有所不同，為了不是自身的慾望而是全體生命，我重視失敗帶來的學習，清楚明白如何可以更好，不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年是武貪豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，整合好同業的資源，形成同盟聯邦的概念，有人出人、有力出力、有錢出錢，這樣的團隊將改變市場模式，而如何讓每個人各司其職，就是自己最重要的工程，打破大家既有的框架及規則，訂定全新的遊戲規則，過程決不輕鬆，卻會創造非常有價值跟豐盛的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產的功課，此時是舊換新的好時機，如果都沒接觸過，此時也是很好學習不動產的一年，至於在工作上，明年是加速團隊前進的一年，清楚的規範及流程，只有讓每個人都聽話照作，夥伴才會開創最豐盛的成果。'
      ]
    },
    {
      'msg': [
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的命宮是天同與太陰兩顆星曜的組合。(簡稱同陰)',
        '命宮是同陰的人擁有的是全世界最強大的溫柔及協調能量，發揮持續、包容、體貼的力量，這樣的能量足以改變所有人的生命層次，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，愈處在同陰的能量裡，愈能在人際之間取得能量，這是一種讓想法及情感流動的能量，這樣的能量可以滴水穿石，改變所有的局面。'
      ],
      'advantage_title': '同陰優勢',
      'advantage': '感受力強，整合能力強，代位思考總為自己帶來好人緣，而人脈總為自己創造很棒的成績。',
      'disadvantage_title': '同陰缺點',
      'disadvantage': '感情豐富優柔寡斷，情緒來時，什麼都聽不進去，沒毅力，片斷的執行造成結果不如預期。',
      'heart_title': '同陰提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，上天給的所有機遇，都是來滋養圓滿的生命，人生可以一起攜手向前是福報，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年是同陰機會滿滿的一年，首先大環境會為自己創造非常多的機會，不管是新朋友還是資源，２０１６年是知識交流並且整合的開始，而整合眾人的人脈是最快的成功方程式，跟愈多的教育團隊作交流，就可以得到最多的資訊及人員，而掌握社群將讓自己收獲滿滿，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，調整不合時宜的規則，把所有不合理的限制拿掉，充分溝通並建立大家都認同的規則，放手去作吧，遇到任何困難大家也都會一起來面對，在辛苦忙碌的２０１６年，也要為自己留下個代表作，一個破除既有框架的作品，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '天府是紫引牌中的輔佐上相，這張牌擁有穩定、通才、財庫、權勢的特質。',
        '你的命宮是天府獨坐。',
        '命宮是天府獨坐的人有統合各方勢力的能力，當自己這樣作時，眾人也會來協助化解難處，自己有足夠的能力讓既有的領域再提升及產生全新的發展，自己能整合各路新想法及情報，這些新資訊可以讓所有人都攀升到更高的境界。來吧，把內心真正想要的慾望及渴望圖像化，不用擔心期待會落空，擁有的能力絕對可以讓自己過更好的生活。愈處在天府的能量裡，愈能在天地之間取得資源，條件已經俱足，放開腳步，大力向前，這是一種穩定的能量，讓人、事、物都穩定的力量。'
      ],
      'advantage_title': '天府優勢',
      'advantage': '運籌帷幄，穩重踏實，各路英雄齊相聚，得權得利眾人都稱羨。',
      'disadvantage_title': '天府缺點',
      'disadvantage': '固執堅持，個性愛指揮，說得比作得多，欠缺行動力。',
      'heart_title': '天府提升能量的內心對白',
      'heart': [
        '『我將會對任何人貢獻心力，我願帶領大家往更好的境界提升，我接受領導也能領導別人，勇敢追夢的過程也會欣然接受上天給予的任何經驗，那將是豐富人生的元素』。',
        '２０１６年是天府借力使力的一年，過去的人際關係將會面臨重大的考驗，此時要懂得向眾人學習，尤其是上位者或長輩，他們擁有自己沒有的資源與人脈，虛心請教將可得到預料之外的協助。整合自己的人際關係，好好分辨哪些人值得深入交往，人脈連結的深度比廣度還來得重要，最後在２０１６年要好好的控管自身的情緒，過去都已經發生了，只有放眼未來，著重在下一步才能讓自己更美好，無謂的情緒，請在最短的時間處理好。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的對宮是天機與天梁兩顆星曜的組合。(簡稱機梁)',
        '命宮空宮而對宮是機梁的組合，顯示自己擁有心靈提升的能力，發揮智慧，讓自己身邊的所有人可以提升到更高的層次，清楚內心真正想要的是什麼，不急不徐的態度一定能實現所有的狀況，人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在機梁的能量裡，愈能接受上天給予的際遇。'
      ],
      'advantage_title': '命宮空宮而對宮是機梁的優勢',
      'advantage': '聰明忠厚有原則，行事穩重，懂得整合新舊之間的力量，讓自己更有能量與能力應付所有狀況。',
      'disadvantage_title': '命宮空宮而對宮是機梁的缺點',
      'disadvantage': '規則制度綁手腳，顧慮東顧慮西，讓自已無法前進，計劃周全不執行還是停在原地而已。',
      'heart_title': '命宮空宮而對宮是機梁提升能量的內心對白',
      'heart': [
        '『我深知自己是個有治癒能力的人，我相信自己的判斷，我有智慧去面對所有事情的困難，凡我能力所及一定竭盡所能，我注定會有個不凡的人生經驗，聆聽內在最深的聲音，而祂總會讓自己知道一條正確的道路，此刻我願意和大家一起攜手並進，一起學習每件事情的精髓』。',
        '２０１６年命宮空宮而對宮是機梁再次突破的一年，過往學習的各方知識及道理，今年要確實執行看到成果，外地各方的機會及資金源源不絕，只要自己願意嚐試就有一定的成績，目前天時地利都已經來到，要讓這些機會創造更美好的結果，最關鍵的是『人和』問題，如何打破彼此的框架，開放所有的可能性，多元化整合，讓所以人都有利益，將是２０１６重要的革命工程。'
      ]
    },
    {
      'msg': [
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '破軍是紫引牌中的溼婆神，這張牌擁有權力、消耗、破壞、創造的特質。',
        '你的命宮是廉貞與破軍兩顆星曜的組合。(簡稱廉破)',
        '命宮是廉破的人是風暴的核心，所有的改變都是好的，改變皆因自己而起，改變是讓自己去學習邁向成功之路，這樣的改變帶來了全新的機緣，享受它吧，無須畏懼，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，這樣的能量會創造更多可能性，嚐試各種方法，破除舊有的框架，精彩豐盛的結果就在自己手上完成。愈處在廉破的能量裡，愈有勇氣告別過去，迎接新的未來，了解各行各業規則的目的，是為了要從新定義，將讓所有人的生活方式完全不同，這是一種蟲化蝴蝶的能量，這樣的能量可以破壞舊框架再重新建設，給所有生命不同的體驗。'
      ],
      'advantage_title': '廉破優勢',
      'advantage': '有創意有想法，能在既有的框架之下創造全新的思維出來，這樣的特質可以讓所有人一起前進。',
      'disadvantage_title': '廉破缺點',
      'disadvantage': '想法另類，獨榭一格，活在自己的世界中，不在乎別人的看法跟想法。',
      'heart_title': '廉破提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，過往經驗協助自己改變，一個全新的自己，正在前面等待著我，人生從此邁向坦途，勇於承擔任何後果，理性看待所有事，果決、堅持是最大的利器，不畏困難在夢想尚未到手之前決不放手，凡能力所及一定竭盡所能，自己是生命的主人，能主宰人生往想要的方向前進，掌握人生的規則秩序，我的人生將從此不同』。',
        '２０１６年是廉破提升境界的一年，過去所有的學習，會在２０１６年融會貫通，並產生全新的思維出來，過去跟著自己的人，首先要提升大家的思維及執行力，再提升大家的專業跟責任，組成大團隊，必須訂定眾人的目標，讓大家步伐一致，發揮最大的戰力，這全部就靠自己居中規範了，要整合協調這樣的團隊，絕非易事，行動力跟執行力都要再加倍，除了大家要責任分擔跟充分授權，賞罰分明更重要，清楚明白的規則，每個人都清楚明白自己的定位，每個人就可以發揮單兵作戰的能力了。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的對宮是太陽與巨門兩顆星曜的組合。(簡稱日巨)',
        '命宮空宮而對宮是日巨的人既內斂且熱情，為了想在人前風光，願意花時間培養自己的實力，認真尋找外面訊息與自己之間的相關性與共通性，它們將是實現目標的引導。自己是所有狀況的核心，花一點時間把身邊凌亂的狀態去除，如此將會提升自信心與能量，啟動深藏在內的能量，日巨的能量具有給予熱情和整合資產並帶動市場的能量，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在日巨的能量裡，愈能改變生命中所有人的環境。'
      ],
      'advantage_title': '命宮空宮而對宮是日巨優勢',
      'advantage': '既柔且剛，有聚集資產的能力，也有帶動潮流的實力，人緣再連結資源能力強，敢為自己開創任何的可能性。',
      'disadvantage_title': '命宮空宮而對宮是日巨缺點',
      'disadvantage': '話說太快，承諾給出去之後發現事情不如預期，容易因環境變化而放棄，堅持跟執行力都不足。',
      'heart_title': '命宮空宮而對宮是日巨提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，以肯定的話語跟天地之間溝通，凡我承諾一定達成，只要我願意宣告我的願景，天地萬物必來助我一臂之力我願意放下一切，我是所有狀況的核心，感恩上天給的所有機遇，我相信用積極貢獻的態度一定能化解所有的狀況』。',
        '２０１６年命宮空宮而對宮是日巨自我定位的一年，找出自己內心深藏的渴望及害怕，過去消耗太多的時間跟體力在無謂的堅持上面，改變堅持的目標，將讓自己有個全然不同的樣貌，而事業的部份必須建立新系統及流程，而目的是把過往傳統管理的作法，作一次大整頓，只有大家都願意調整位置及心態，事業的發展才會更上一層樓，因此２０１６是內部人事變動的一年，而想要調整內部，首先要先改變過去的規範，過往考量的人情包袱、規則限制，都必須打破，先有大破的想法，再來制定重生的作法，然後建立團隊文化及價值，文化的建立需要長時間的經營，而價值的建立將以自己為核心來發展，２０１６就是團隊共同建立價值的一年。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的對宮是武曲與貪狼兩顆星曜的組合。(簡稱武貪)',
        '命宮空宮而對宮是武貪的人擁有喜悅能力去創造奇蹟與實現願望，展現輕鬆的態度能開創全新的局面。本身是非常有才華及能力的人，可以改變陳舊的常規，善念可以造福所有人讓局面雙贏，謹慎選擇想法及點子將讓自己生命更豐富，自己有能力點石成金，讓原本平凡無奇的計畫變成精彩又豐盛，放心！願景會實現出來的，自己有能力創造更精彩的生命，愈處在武貪的能量裡，愈能得到人際資源及顯化力，這是一種讓資源槓桿的能量，放手去實現更美好的結果。'
      ],
      'advantage_title': '命宮空宮而對宮是武貪優勢',
      'advantage': '既柔且剛，身段柔軟內心堅持，輕鬆與剛硬兼顧，各式自樣的資源及人脈，都可以整合到身邊。',
      'disadvantage_title': '命宮空宮而對宮是武貪缺點',
      'disadvantage': '內外落差大，忽冷忽熱，給人表裡不一，行事風格容易讓人誤解。',
      'heart_title': '命宮空宮而對宮是武貪提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，經驗協助自己改變，堅持目標，努力實踐目標來激勵自己，我將把所有能量累積至最高的正能量，天地將因自己而有所不同，為了不是自身的慾望而是全體生命，我重視失敗帶來的學習，清楚明白如何可以更好，不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年命宮空宮而對宮是武貪豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，整合好同業的資源，形成同盟聯邦的概念，有人出人、有力出力、有錢出錢，這樣的團隊將改變市場模式，而如何讓每個人各司其職，就是自己最重要的工程，打破大家既有的框架及規則，訂定全新的遊戲規則，過程決不輕鬆，卻會創造非常有價值跟豐盛的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產的功課，此時是舊換新的好時機，如果都沒接觸過，此時也是很好學習不動產的一年，至於在工作上，明年是加速團隊前進的一年，清楚的規範及流程，只有讓每個人都聽話照作，夥伴才會開創最豐盛的成果。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的對宮是天同與太陰兩顆星曜的組合。(簡稱同陰)',
        '命宮空宮而對宮是同陰的人擁有的是全世界最強大的溫柔及協調能量，發揮持續、包容、體貼的力量，這樣的能量足以改變所有人的生命層次，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，愈處在同陰的能量裡，愈能在人際之間取得能量，這是一種讓想法及情感流動的能量，這樣的能量可以滴水穿石，改變所有的局面。'
      ],
      'advantage_title': '命宮空宮而對宮是同陰優勢',
      'advantage': '感受力強，整合能力強，代位思考總為自己帶來好人緣，而人脈總為自己創造很棒的成績。',
      'disadvantage_title': '命宮空宮而對宮是同陰缺點',
      'disadvantage': '感情豐富優柔寡斷，情緒來時，什麼都聽不進去，沒毅力，片斷的執行造成結果不如預期。',
      'heart_title': '命宮空宮而對宮是同陰提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，上天給的所有機遇，都是來滋養圓滿的生命，人生可以一起攜手向前是福報，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年命宮空宮而對宮是同陰機會滿滿的一年，首先大環境會為自己創造非常多的機會，不管是新朋友還是資源，２０１６年是知識交流並且整合的開始，而整合眾人的人脈是最快的成功方程式，跟愈多的教育團隊作交流，就可以得到最多的資訊及人員，而掌握社群將讓自己收獲滿滿，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，調整不合時宜的規則，把所有不合理的限制拿掉，充分溝通並建立大家都認同的規則，放手去作吧，遇到任何困難大家也都會一起來面對，在辛苦忙碌的２０１６年，也要為自己留下個代表作，一個破除既有框架的作品，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '命宮紫微獨坐，顯示自己非常優秀也很有能力是一個可以沉著面對當下狀態的王者，一步一腳印的處理事情，在孤獨默默承受所有責任的表相之下，藏著不願意輸給任何人的企圖心，而自己有優越感榮譽心及偉大的使命感，很有事業慾，企圖心強盛，當然有時也顯出固執和倔強，愈處在紫微的能量裡，愈發現自身充滿了正面力量及渴望，接受各種建議總能讓成績更上一層樓。'
      ],
      'advantage_title': '紫微獨坐優勢',
      'advantage': '能力強，大小事情都能處理，作決定速度快，深謀遠慮。',
      'disadvantage_title': '紫微獨坐缺點',
      'disadvantage': '校長兼撞鐘，內心不相信別人，什麼都要自己來，讓別人難接近，自己也累垮了。',
      'heart_title': '紫微獨坐提升能量的內心對白',
      'heart': [
        '『我相信自己，這是個性中權威的本質，人生由自己開創，願承擔所有的決定，自己擁有豐富的生命力，遇困境皆能逆來順受，此刻願意放下自大與傲慢，為的不是自己的私慾，而是決定領導及承擔所有的責任，進而創造人與人之間更美好的生命』。',
        '２０１６年的紫微獨坐在工作領域要重新定位，工作上會面臨到職場環境的調整，調整的當下會感到不舒服，而這樣的調整是為了因應大環境的改變，讓工作可以有更高的機動性，所以首先找出自己在事業上的定位，挖掘自己的潛能，找出深層的渴望，要求自己實現出來，什麼是可行的計劃？而到達目標跟成就又需要整合多少的資源跟協調多少人力，利用２０１６把資源整合起來，好消息是２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來協助自己建立基礎的，切勿跟這樣的力量相競爭，競爭只是減弱彼此的力量，合作才能開創全新的局面。'
      ]
    },
    {
      'msg': [
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '命宮是天機獨坐的人擁有解決任何情況的能力，在略顯孤傲的表相之下，內在隱藏著智慧，而不急不徐的態度能化解所有的狀況，善良的自己為了不替別人造成困擾總是一人面對所有的事，但人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機星的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '天機獨坐優勢',
      'advantage': '聰明反應快，心思細膩，考慮周詳，做事接步就班，一步一腳印。',
      'disadvantage_title': '天機獨坐缺點',
      'disadvantage': '空有想法，行動力不足，沒有周全的計劃不上路，沒有人帶領，不敢衝。',
      'heart_title': '天機獨坐提升能量的內心對白',
      'heart': [
        '『相信自己的判斷，自己有智慧去面對所有事情的困難，此刻願意和大家一起攜手並進，在這樣的事件當中讓每個人都能成長』。',
        '２０１６年是天機獨坐實現自我理想的一年，過往累積出來的物資及人際關係，今年是多元整合的最佳時機，外地各方的機會源源不絕，這些資源跟機會都必須靠自己的智慧來分析並且整合，要讓這些機會創造更美好的結果，首先要市場接受度及市場觀感的問題，品質很重要，價格也要是市場可以接受的，如此才能雙贏，只顧自身的利益最後會讓自己得不償失，因此多元整合，以大眾利益為利益，將幫助自己建立起長治久安的局面。。'
      ]
    },
    {
      'msg': [
        '七殺是紫引牌中的成敗之神，這張牌擁有威嚴、紀律、剛強、變動的特質。',
        '你的命宮是七殺獨坐。',
        '命宮是七殺獨坐的人擁有決戰第一線的能量，自己十足的執行力跟行動力，只要訂下任務，不管多艱辛困難，一定讓自己使命必達，自己總是衝第一，為的不是自己的私慾，而是團隊所有人更光明的未來，自己是勇敢的領導者，領導著整個團隊往前，挫折會成為未來成功的墊腳石，勇敢跨出每一步，每一步都是光明的未來。愈處在七殺的能量裡，愈發現充滿了幹勁及渴望，這是一種突破現況的能量，讓大家都前進的力量。'
      ],
      'advantage_title': '七殺優勢',
      'advantage': '耐操好用拚第一，積極果斷不遲疑，目標明顯一路前行不怕苦不怕難。',
      'disadvantage_title': '七殺缺點',
      'disadvantage': '衝動行事好後悔，一將功成萬骨枯，再回頭已百年身，容易給人踩著別人肩膀往上爬的感覺。',
      'heart_title': '七殺提升能量的內心對白',
      'heart': [
        '『人生由我開創，承擔任何的決定，我將理性的看待所有事，果決、堅持是自己最大的利器，不畏困難在夢想尚未到手之前，自己絕不放手』。',
        '２０１６年是七殺建軍整備的一年，過去的模式將會面臨重大的考驗，此時的局面是我不犯別人，別人卻大軍壓境，逃避不是長久之際，只有面對面硬碰硬才有活路，既然要互相競爭了，建軍整備是必須的，找志同道合的人組成作戰部隊，出發前把計劃跟資金都準備好，統合專業人士的意見，一方面聽取建議，一方面也讓自己的專業再提升。在態勢未明之時，聽話照作是非常重要的，充分授權給專業人士，甚至請專業人士作好計劃，將可讓自己立於不敗之地，２０１６年錢要花在刀口上，穩健踏實的走下一步，才是最佳的方式。'
      ]
    },
    {
      'msg': [
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的命宮是太陽與天梁兩顆星曜的組合。(簡稱陽梁)',
        '命宮是陽梁的人既堅持且熱情，為了讓整個社會更公平正義，願意花時間改變不公不義的事件上，自己是個敦厚而仁慈的人，總為大家扛起重責大任，總是一人承擔所有的責難。熱情與付出會讓事件往光明面去發展，自己是所有狀況的核心，積極貢獻的態度一定能化解所有的狀況。清楚內心真正想要的是什麼，透過靜坐、禱告都會獲得訊息，自己擁有一個神奇的力量，善用這樣的能量，將讓自己處處是機會，處處都是可以貢獻的舞台，愈處在陽梁的能量裡，愈能掌控生命中人事物的規則。'
      ],
      'advantage_title': '陽梁優勢',
      'advantage': '黑白分明，決不妥協，擁有教化人心的力量，透過一次又一次的經驗累積讓自己成為不敗的勇者。',
      'disadvantage_title': '陽梁缺點',
      'disadvantage': '固執堅持，為辯而辯，好勝心強，指揮別人一流，自身的行動力比較弱。',
      'heart_title': '陽梁提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，凡能力所及一定竭盡所能，我注定會有個不凡的人生經驗，自己是所有狀況的核心，感恩上天給的所有機遇，聆聽內在最深的聲音，我總會知道一條正確的道路，並且相信用積極貢獻的態度一定能化解所有狀況』。',
        '２０１６年是陽梁在家庭及群體中自我定位的一年，找出自己內心深藏的渴望及害怕，那些跟自己的成長過程有關，找出確實可行的目標，將讓自己有個全然不同的動力前進，而事業的部份必須建立新系統及流程，而目的是把過往資源的分配，作一次大整頓，只有大家都願意打開心胸溝通出來，事業的發展才會更上一層樓，因此２０１６是內部資源整合的一年，而想要調整內部，首先要先改變過去的規範，過往考量的人情包袱、利益分配，都必須打破，先有大破的想法，再來制定全新的流程，然後建立團隊文化及價值，文化的建立需要長時間的經營，而價值的建立將以自己為核心來發展，２０１６就是團隊共同建立執行計劃的一年。'
      ]
    },
    {
      'msg': [
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '天相是紫引牌中的協調、調度之神，這張牌擁有盡責、福善、面子、隨和的特質。',
        '你的命宮是武曲與天相兩顆星曜的組合。(簡稱武相)',
        '命宮是武相的人擁有高度協調並懂得如何授權與團隊合作的重要性，展現協調的能力整合全新的資源。協調及整合是自己的強項，雙方的資源可以透過自己來交流，雙贏局面可以造福所有人，謹慎選擇想法及點子將讓自己生命更豐富，自己有能力點石成金，讓原本平凡無奇的計畫變成精彩又豐盛，放心！願景會實現出來的，自己有能力創造更精彩的生命，愈處在武相的能量裡，愈能得到專業資源及顯化力，這是一種讓能量互相交流的狀況，放手去實現更美好的未來。'
      ],
      'advantage_title': '武相優勢',
      'advantage': '親和力夠，羅輯分析強，妥協與原則兼顧，各式自樣的專業人脈，都在身邊彼此交流。',
      'disadvantage_title': '武相缺點',
      'disadvantage': '名利放不掉，易給人自私的感覺，倆邊兼顧容易讓自己裡外不是人。',
      'heart_title': '武相提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，經驗協助自己改變，我會以樂觀的態度和信心協調所有的人、事、物，讓每個人、事、物都在自身的位置發揮出最大的價值，堅持目標，努力實踐目標來激勵自己，我將把所有能量累積至最高的正能量，天地將因自己而有所不同，為了不是自身的慾望而是雙方的利益，不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年是武相豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，連結同業的資源，創造一個新的品牌或集團，結合各家所長，新品牌會讓市場眼睛一亮，而如何讓每個人都獲利，就是自己最重要的工程，打破大家既有的框架及規則，訂定全新的遊戲規則，過程決不輕鬆，卻會創造非常有價值跟豐盛的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產的功課，此時是買到理想物件的好時機，如果都沒接觸過，此時也是很好學習規劃不動產的一年，至於在工作上，明年是加速團隊前進的一年，帶頭作，示範給所有人看，讓所有人都有個範本，團隊才會開創最豐盛的成果。'
      ]
    },
    {
      'msg': [
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的命宮是天同與巨門兩顆星曜的組合。(簡稱同巨)',
        '命宮是同巨的人擁有時間分配、財富整合跟互通資源的能力，本身擁有話語的力量，這樣的能量會影響所有人的生活方式，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，找尋這些訊息彼此之間的相關性與共通性，它們將是實現目標的引導。愈處在同巨的能量裡，愈能在人際之間取得資源，這是一種讓訊息與實物流動的能量，這樣的能量可以形成文化，改變所有的生命。'
      ],
      'advantage_title': '同巨優勢',
      'advantage': '觀察力強，整合能力強，透過表達總為自己帶來想不到的機緣，而人脈總為自己創造很棒的生活品質。',
      'disadvantage_title': '同巨缺點',
      'disadvantage': '心直口快，說者無心聽者有意，自己評價很兩極，資產分配不均，易惹來抹黑跟造反。',
      'heart_title': '同巨提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，我以肯定的話語跟所有人溝通，凡承諾一定達成，宣告的眾人願景，天地萬物必來助我一臂之力，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年是同巨機會滿滿的一年，首先大環境會為自己創造非常多的機會，過去的老朋友及資源再度的連結，２０１６年是新舊交流並且重生的開始，而整合過去的經驗是最快的成功方程式，跟愈多的通路平台作交流，就可以得到最多的資源及訊息，而掌握訊息將讓自己收獲滿滿，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，放手去作吧，遇到任何困難大家也都會一起來協助，在辛苦忙碌的２０１６年，也要為自己留下個成績，一個破除既得利益者，資產重新再分配的成績，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是貪狼獨坐。',
        '命宮是貪狼獨坐的人擁有的是全世界最強大的任何能量，自己能喜悅的去創造奇蹟與實現願望，愈是輕鬆的態度愈能為自己開創全新的局面。雖然狀況很多讓自己非常忙碌，不過自己非常清楚當下的每個位置，自己擁有足夠的能力去改變所有的遊戲規則，本身多才多藝，學習力強，應變快，善念將造福所有人讓局面多贏，天賦才華用在哪裡，哪裡就得到成就。愈處在貪狼的能量裡，愈能在天地之間取得能量，這是一種豐富多元的能量，讓人、事、物都提升境界的力量。'
      ],
      'advantage_title': '貪狼優勢',
      'advantage': '多才多藝，個性積極不放棄，多變靈活，堅持前進，不達目標絕不停止。',
      'disadvantage_title': '貪狼缺點',
      'disadvantage': '性急好動沒耐心，坐這山望那山不滿足，改來變去給人感覺高度的不定性。',
      'heart_title': '貪狼提升能量的內心對白',
      'heart': [
        '『我清楚明白如何可以讓所有人都變的更好，我不只為了自身的慾望而是全體生命，如此天地將是自己的遊樂場，我將會把所有能量累積至最高的正能量，天地將因自己而有所不同』。',
        '２０１６年是貪狼站上舞台的一年，過去自己努力培養的才能，是時候展現給所有人看了，找出自己的定位，讓所有人都認同，讓人認同最好的方式就是不斷宣揚自己的理念，不斷的說，什麼場合都說，什麼人都說，在自我宣傳的過程，也可以找到意同道合的夥伴，彼此可以互相輔助，一起前進，在工作上首先要讓內部支援系統就定位，支持系統跟不上自己的腳步，再好的發展都會出問題，所謂的系統是不管任何人來操作，都是一樣的流程，跟一樣的品質，系統需要時間建立，好好用心在這個部份，未來會很感恩這部份。'
      ]
    },
    {
      'msg': [
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的命宮是太陰獨坐。',
        '命宮是太陰獨坐的人擁有的是全世界最強大的溫柔能量，當自己打開心門時，情感、財富、機緣及療癒性的能量都會進入生命當中，不用讓未知的情況來困擾自己，自己很有力量。發揮持續、包容、體貼的力量，這樣的能量足以改變生命層次，自己是受到上天給予祝福的，上天也會讓自己感受到生命的喜悅。愈處在太陰的能量裡，愈能在人與人之間的情感取得能量，這是一種照顧貢獻的能量，讓人、事、物都成長的力量。'
      ],
      'advantage_title': '太陰優勢',
      'advantage': '多才多藝，外柔內剛重感情，當心中有決定時絕不退縮，適應力強身段柔軟。',
      'disadvantage_title': '太陰缺點',
      'disadvantage': '晴時多雨偶陣雨，猶豫不決想得多，什麼都懂不專精，情緒化造成表現時好時壞。',
      'heart_title': '太陰提升能量的內心對白',
      'heart': [
        '『我懂得運用溫柔和包容的力量，這是專屬自己的靈性特質，感恩上天給的所有機遇，這些機緣都讓生命更加的圓滿，我會用正向積極的態度面對未來』。',
        '２０１６年是太陰觀念改變的一年，認識愈多的人，彼此的交流可以得到最新的訊息及想法，此時要懂得開口向眾人請教，別人的想法是打開自己智慧的鑰匙，往往彼此間觀念的交流，反而讓自己發現新大陸，有了想法，走出去才能執行出來，先執行再依狀況作調整，訂出施行步驟及時間表，是否能確實執行，將決定２０１６是否豐收，自己要有產業共好的概念，彼此合作彼此交流是雙贏最好的方式，最後在２０１６年要好好的調整自身的人際關係，朋友才是最大的力量，沒有敵人走得長久，同理心是關鍵。'
      ]
    },
    {
      'msg': [
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '天府是紫引牌中的輔佐上相，這張牌擁有穩定、通才、財庫、權勢的特質。',
        '你的命宮是廉貞與天府兩顆星曜的組合。(簡稱廉府)',
        '命宮是廉府的人有統合各方勢力的能力，當自己這樣作時，大家也會過來協助，幫忙化解難處，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，這樣的能量會創造更多可能性，嚐試各種方法，整合眾人的資源，一起開創出精彩豐盛的結果。愈處在廉府的能量裡，愈能在天地之間取得資源，放開腳步，大力向前。了解各行各業規則的目的，是為了要讓大家都獲利，將讓所有人的生活品質完全不同，這是一種霸主的能量，這樣的能量可以統合各方勢力，讓所有生命有更高的品質。'
      ],
      'advantage_title': '廉府優勢',
      'advantage': '穩重踏實，專貴氣質，架勢十足，整合手腕靈活，身邊會吸引有能力的人一起來共事。',
      'disadvantage_title': '廉府缺點',
      'disadvantage': '掌控慾強，名利慾望重，得到再多還是不滿足，容易跟人私慾重的感受。',
      'heart_title': '廉府提升能量的內心對白',
      'heart': [
        '『我懂得對任何人付出，我能帶領大家往更好的境界提升，我接受領導也能領導別人，勇敢追夢也會欣然接受上天給予的任何經驗，那將是豐富人生的元素，不畏困難在夢想尚未到手之前決不放手，凡能力所及一定竭盡所能，自己是生命的主人，能主宰人生往想要的方向前進，掌握人生的規則秩序，我的人生將從此不同』。',
        '２０１６年是廉府提升境界的一年，過去努力的各方資源，會在２０１６年統合完成並且建立通路，新的作業模式將讓所有人眼睛一亮，過去一起努力的團隊，首先要加速大家的效率，再提升大家的能力跟位置，組成上下整合、左右合併的大團隊，必須訂定眾人的目標，讓大家步伐一致，發揮最大的戰力，這全部就靠自己居中整頓了，要整合協調這樣的團隊，絕非易事，自己的行動力跟執行力都要再加倍，一方面跟所有人通知，一方面把流程制定出來，市佔率更是重要，把每個環節都鎖緊，每個人都清楚明白自己的定位，２０１６年是開創傳奇的開始。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的對宮是太陽與天梁兩顆星曜的組合。(簡稱陽梁)',
        '命宮空宮而對宮是陽梁的人既堅持且熱情，為了讓整個社會更公平正義，願意花時間改變不公不義的事件上，自己是個敦厚而仁慈的人，總為大家扛起重責大任，總是一人承擔所有的責難。熱情與付出會讓事件往光明面去發展，自己是所有狀況的核心，積極貢獻的態度一定能化解所有的狀況。清楚內心真正想要的是什麼，透過靜坐、禱告都會獲得訊息，自己擁有一個神奇的力量，善用這樣的能量，將讓自己處處是機會，處處都是可以貢獻的舞台，愈處在陽梁的能量裡，愈能掌控生命中人事物的規則。'
      ],
      'advantage_title': '命宮空宮而對宮是陽梁優勢',
      'advantage': '黑白分明，決不妥協，擁有教化人心的力量，透過一次又一次的經驗累積讓自己成為不敗的勇者。',
      'disadvantage_title': '命宮空宮而對宮是陽梁缺點',
      'disadvantage': '固執堅持，為辯而辯，好勝心強，指揮別人一流，自身的行動力比較弱。',
      'heart_title': '命宮空宮而對宮是陽梁提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，凡能力所及一定竭盡所能，我注定會有個不凡的人生經驗，自己是所有狀況的核心，感恩上天給的所有機遇，聆聽內在最深的聲音，我總會知道一條正確的道路，並且相信用積極貢獻的態度一定能化解所有狀況』。',
        '２０１６年命宮空宮而對宮是陽梁在家庭及群體中自我定位的一年，找出自己內心深藏的渴望及害怕，那些跟自己的成長過程有關，找出確實可行的目標，將讓自己有個全然不同的動力前進，而事業的部份必須建立新系統及流程，而目的是把過往資源的分配，作一次大整頓，只有大家都願意打開心胸溝通出來，事業的發展才會更上一層樓，因此２０１６是內部資源整合的一年，而想要調整內部，首先要先改變過去的規範，過往考量的人情包袱、利益分配，都必須打破，先有大破的想法，再來制定全新的流程，然後建立團隊文化及價值，文化的建立需要長時間的經營，而價值的建立將以自己為核心來發展，２０１６就是團隊共同建立執行計劃的一年。'
      ]
    },
    {
      'msg': [
        '破軍是紫引牌中的溼婆神，這張牌擁有權力、消耗、破壞、創造的特質。',
        '你的命宮是破軍獨坐。',
        '命宮是破軍獨坐的人擁有重生的能量，自己有十足的堅持力跟創意，只要立下目標，不管要付出什麼代價，一定讓目標實現，自己決不放棄，自己是堅強的創造者，領導著整個團隊往前，挫折是成功的過程，改變是讓自己去學習成長進而讓自己邁向成功之路，改變創造出全新的機緣，勇敢接受並面對，自己每一步都是走向光明的未來。愈處在破軍的能量裡，愈有勇氣告別過去，迎接新的未來，這是一種狀態改變的能量，讓大家都進化的力量。'
      ],
      'advantage_title': '破軍優勢',
      'advantage': '創意改革、堅持突破，為了心中的理念，不惜花費任何代價，都要實現。',
      'disadvantage_title': '破軍缺點',
      'disadvantage': '消耗自己同時也把身邊人的能量消耗光，任何代價是用在乎自己的人去付的。',
      'heart_title': '破軍提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，我讓經驗來協助改變，一個全然不同的自己，正在前面等待著，自己走的路，自己開創，我要走一條所有人都沒走過的路』。',
        '２０１６年是破軍呼朋引伴的一年，人生觀相同才能成為戰友，能彼此合作的才是盟友，認識愈多的人，才能從中找到知己同好，想要組織一個有戰力的隊伍，廣泛認識人，對自己會很有幫助，而想要讓別人認同，必須有自己的產品，一個能表達自己理念及人生觀的產品，在整個２０１６年，自己必須去完成這樣的產品，另外在事業上，也必須要有作戰的盟友，盟軍不用多，精兵反而好整合，交流彼此的想法，資源互相交換，有共同的目標及願景，市場很大，這樣的陣容什麼都能拿到，但先在某個領域作到位，反而會建立聲勢，當受到大家的矚目之後，其餘的市場再慢慢打。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的對宮是天同與巨門兩顆星曜的組合。(簡稱同巨)',
        '命宮空宮而對宮是同巨的人擁有時間分配、財富整合跟互通資源的能力，本身擁有話語的力量，這樣的能量會影響所有人的生活方式，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，找尋這些訊息彼此之間的相關性與共通性，它們將是實現目標的引導。愈處在同巨的能量裡，愈能在人際之間取得資源，這是一種讓訊息與實物流動的能量，這樣的能量可以形成文化，改變所有的生命。'
      ],
      'advantage_title': '命宮空宮而對宮是同巨優勢',
      'advantage': '觀察力強，整合能力強，透過表達總為自己帶來想不到的機緣，而人脈總為自己創造很棒的生活品質。',
      'disadvantage_title': '命宮空宮而對宮是同巨缺點',
      'disadvantage': '心直口快，說者無心聽者有意，自己評價很兩極，資產分配不均，易惹來抹黑跟造反。',
      'heart_title': '命宮空宮而對宮是同巨提升能量的內心對白',
      'heart': [
        '『我擁有一群真誠互信的好友，我感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，我以肯定的話語跟所有人溝通，凡承諾一定達成，宣告的眾人願景，天地萬物必來助我一臂之力，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年命宮空宮而對宮是同巨機會滿滿的一年，首先大環境會為自己創造非常多的機會，過去的老朋友及資源再度的連結，２０１６年是新舊交流並且重生的開始，而整合過去的經驗是最快的成功方程式，跟愈多的通路平台作交流，就可以得到最多的資源及訊息，而掌握訊息將讓自己收獲滿滿，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，放手去作吧，遇到任何困難大家也都會一起來協助，在辛苦忙碌的２０１６年，也要為自己留下個成績，一個破除既得利益者，資產重新再分配的成績，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '紫微是紫引牌中的帝王，這張牌擁有專業、尊貴、權威、領導的特質。',
        '破軍是紫引牌中的溼婆神，這張牌擁有權力、消耗、破壞、創造的特質。',
        '你的命宮是紫微與破軍兩顆星曜的組合。(簡稱紫破)',
        '命宮是紫破的組合，顯示自己創意十足，在敦厚溫和的外表之下，藏著不願意輸給任何人的企圖心，而所有的改變都是好的，改變都是讓自己去學習成長進而讓自己邁向成功之路，愈處在紫微、破軍的能量裡，愈發現目前環境及精神都面臨變化，自己有勇氣告別過去，迎接新的未來。'
      ],
      'advantage_title': '紫破優勢',
      'advantage': '高瞻遠矚，有想法敢破壞規則而且堅持到底，生命的格局是讓自己開創出來的。',
      'disadvantage_title': '紫破缺點',
      'disadvantage': '奔波忙碌，大起大落，一刻不得閒，堅持自我卻把身邊的人都拖下去。',
      'heart_title': '紫破提升能量的內心對白',
      'heart': [
        '『我相信自己，這是個性中權威的本質，人生是過往不斷的累積，經驗協助改變，一個全然不同的自己，正在前面等待著，此刻願意放下自大與傲慢，為的不是自己的私慾，而是放下過去的束縛，先在情感和心態上作割捨，昔日困境的目的是給予心靈上的茁壯，一切現在才要開始』。',
        '２０１６年的紫破在工作領域是重新定位的一年，工作上會面臨到人際關係的調整，調整的當下會感到不舒服，而這樣的調整是把過往虛浮的工作態度打掉並且要重新建設，所以首先找出自己內在的規則，調整自己的比重，把過往在各領域學到的知識和方法，什麼是可以重新調整的？而到達目標跟成就又需要建立多少的系統跟花費多少時間，利用２０１６把計劃訂出來，好消息是２０１６年也會出現強而有力的貴人在身邊，這樣有能力的人是來協助自己建立通路基礎的，切勿跟這樣的力量相競爭，競爭只是減弱彼此的力量，合作才能開創全新的局面，通路的建立是讓自己可以多元性發展，進而創造出更大的局面。'
      ]
    },
    {
      'msg': [
        '天機是紫引牌中的智慧之神，這張牌擁有智慧、變化、善良、玄學的特質。',
        '命宮是天機獨坐的人擁有解決任何情況的能力，在略顯孤傲的表相之下，內在隱藏著智慧，而不急不徐的態度能化解所有的狀況，善良的自己為了不替別人造成困擾總是一人面對所有的事，但人與人之間的關係是互相和包容的，善用眾人的力量，將會讓成果更豐盛。愈處在天機星的能量裡，愈能開啟上天給予的智慧。'
      ],
      'advantage_title': '天機獨坐優勢',
      'advantage': '聰明反應快，心思細膩，考慮周詳，做事接步就班，一步一腳印。',
      'disadvantage_title': '天機獨坐缺點',
      'disadvantage': '空有想法，行動力不足，沒有周全的計劃不上路，沒有人帶領，不敢衝。',
      'heart_title': '天機獨坐提升能量的內心對白',
      'heart': [
        '『相信自己的判斷，自己有智慧去面對所有事情的困難，此刻願意和大家一起攜手並進，在這樣的事件當中讓每個人都能成長』。',
        '２０１６年是天機獨坐再次突破的一年，過往作好的計劃，只要是提升自我專業的，今年是實現的最佳時機，好消息：２０１６年是人脈大幅擴展的一年，這些人脈都是自己過去結交的好朋友、好同學、好同事，統合好將會擁有超過想像的團隊，而想要讓團隊發揮出最佳戰力，首先要凝聚團隊共識，並且分進合擊，每個人都多跟自己領域的專業人士交流，再來結合並整合彼此的資訊，相互資源整合，將對團隊的每個人都有很大的助益，勇於開放各種可能性，多方且多元的發長，只要一步一腳印，心念正面向上都會有不錯的成績，總結：２０１６是機會多多，同時也是忙碌奔波的一年，相信自己，讓自己在專業上再突破。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的對宮是廉貞與貪狼兩顆星曜的組合。(簡稱廉貪)',
        '命宮空宮而對宮是廉貪的人有足夠的能力可以改變陳舊的常規，本身是非常有才華及能力的人，自己的善念可以讓所有人雙贏，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，這樣的能量會創造更多可能性，自己是創造奇蹟與實現願望的高手，惟有展現輕鬆的態度才能為自己開創全新的局面。愈處在廉貪的能量裡，愈願意在天地之間打開自己的心輪，讓豐富的想像力與心靈跟上天宇宙作連結，了解人事物的規則，是為了要讓大家都能開心過日子，自己將讓所有人的身心靈完全不同，這是一種太極的能量，這樣的能量可以扭轉乾坤，讓所有生命都得以提升。'
      ],
      'advantage_title': '命宮空宮而對宮是廉貪優勢',
      'advantage': '剛柔並濟，企圖堅持，處事手腕靈活，天地萬物的各種資源都會靠向自己。',
      'disadvantage_title': '命宮空宮而對宮是廉貪缺點',
      'disadvantage': '坐這山望那山，沒耐心，機會來了卻掌握不好，樣樣俱備卻不滿足，人心不足蛇吞象。',
      'heart_title': '命宮空宮而對宮是廉貪提升能量的內心對白',
      'heart': [
        '『天地是自己的遊樂場，我清楚明白自己是遊戲規則的制定者，我不只為了自身的慾望而是全體生命，我將會把所有能量累積至最高的正能量，天地將因我而不同，不畏困難在夢想尚未到手之前決不放手，凡能力所及一定竭盡所能，自己是生命的玩家，能主宰人生往想要的方向前進，掌握人生的規則秩序，我的人生將從此不同』。',
        '２０１６年命宮空宮而對宮是廉貪提升境界的一年，過去聚來的各種資源，會在２０１６年統合完成並且改變市場，全新的模式將讓所有人眼睛一亮，過去一起努力的團隊，首先要加深大家的專業，再提升團隊中每個人的能力跟影響力，組成單一組織卻各自作戰的團隊，這樣的團隊首先必須訂定眾人的目標，讓大家目標一致，各自發揮最大的戰力，這全部就靠自己居中整頓了，要整合協調這樣的團隊，絕非易事，自己的行動力跟執行力都要再加倍，一方面整合各路資源，一方面把所有人的位置制定出來，市場的接受度更是重要，重視市場的聲音，內部把每個環節都鎖緊，每個人都清楚明白自己的定位，２０１６年是精彩豐盛的開始。'
      ]
    },
    {
      'msg': [
        '太陽是紫引牌中的貢獻之神，這張牌擁有光明、博愛、教化、付出的特質。',
        '命宮是太陽獨坐的人熱情與付出會讓事件往光明面去發展，自己是所有狀況的核心，積極貢獻的態度一定能化解所有的狀況，太陽的能量具有散發和溫暖的性質，善用這樣的能量，將讓自己處處是機會，處處都是眾人注目的焦點，愈處在太陽星的能量裡，愈能接受到上天持續關愛的能量。'
      ],
      'advantage_title': '太陽獨坐優勢',
      'advantage': '熱情活躍，教化付出，人緣好行動力十足，只要自己想要的，就會努力去達成。',
      'disadvantage_title': '太陽獨坐缺點',
      'disadvantage': '做事三分鐘熱度，願景很美好但過程中變化太多，不如自己預期就放棄。',
      'heart_title': '太陽獨坐提升能量的內心對白',
      'heart': [
        '『我專注於上天給的溫暖和愛，坦然接受上天的照顧，我願意放下一切，我是所有狀況的核心，我相信用積極貢獻的態度一定能化解所有的狀況』。',
        '２０１６年是太陽獨坐自我沈澱的一年，找出自己內心深藏的渴望及慾望，確實執行的過程中，將讓自己有個全然不同的動力前進，事業的部份必須建立系統及ｓｏｐ流程，讓所有人都清楚明白自己的責任及規範，每個人都清楚流程作法，創造出來的結果將更為理想，２０１６是內部整頓的一年，而想要內部整頓，首先要先改變過去的規則，將過去的作法及規範作大幅度的改變，先接受可能性的想法，再來找怎麼作的作法，然後建立團隊文化及責任分配，文化的建立需要長時間的經營，一旦建立之後就會形成系統，這樣的系統是未來複製的原型，而自己在２０１６年最大的任務就是一步一腳印去實現出來。'
      ]
    },
    {
      'msg': [
        '武曲是紫引牌中的財富之神，這張牌擁有堅持、創意、財富、壓抑的特質。',
        '七殺是紫引牌中的成敗之神，這張牌擁有威嚴、紀律、剛強、變動的特質。',
        '你的命宮是武曲與七殺兩顆星曜的組合。(簡稱武七)',
        '命宮是武七的人擁有堅定的信念，自身充滿了幹勁及渴望，自己總是身先士卒的開創了所有的機會，謹慎選擇想法及點子將讓自己生命更豐富，自己有能力點石成金，讓原本平凡無奇的計畫變成精彩又豐盛，為的不是自己的私慾，而是整個家族更光明的未來，自己有能力創造所有人精彩的生命，愈處在武七的能量裡，愈能得到幹勁、渴望及顯化力，這是一種披荊斬棘的能量，放手去改變這個世界，創造更美好的未來。'
      ],
      'advantage_title': '武七優勢',
      'advantage': '不畏辛苦，分析執行力強，下定決心就義無反顧，意志力及承受力比任何人都強。',
      'disadvantage_title': '武七缺點',
      'disadvantage': '個性剛強硬碰硬，冷面理性真無情，好強的個性傷了自己也傷了所有的人。',
      'heart_title': '武七提升能量的內心對白',
      'heart': [
        '『人生是過往不斷的累積，經驗協助自己改變，人生由自己開創，我承擔任何決定，理性看待所有事，果決、堅持是最大的利器，不畏困難在夢想尚未到手之前決不放手，我將把所有能量累積至最高的正能量，天地將因自己而有所不同，為了不是自身的慾望而是雙方的利益，不畏風險勇於承擔責任的風格，使結果都能豐盛』。',
        '２０１６年是武七豐盛收割的一年，首先同業之間橫向連結將會創造出很多的機會，連結同業的模式，形成同盟聯邦的新模組，有人出力、有人出力、有人出錢，這樣的商業模式將改變市場模式，而如何讓每個人都發揮專屬的價值，就是自己最重要的工程，找出大家的特質及強項，各自是品牌，合起來更是品牌，過程決不輕鬆，卻會創造非常有價值跟豐盛的結果，而個人資產也將在２０１６年倍增，如果過去已經作好房地產或投資的功課，此時正是資產倍增的時機，如果都沒接觸過，此時也是很好學習的一年，至於在工作上，明年是加速團隊前進的一年，自己擔任領頭羊的角色，自己大步向前，夥伴們才能跟隨在後，進而開創最豐盛的成果。'
      ]
    },
    {
      'msg': [
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的命宮是天同與天梁兩顆星曜的組合。(簡稱同梁)',
        '命宮是同梁的人是個敦厚而仁慈的人，總是扛起重責大任，總是承擔所有孤寂，本身擁有教化的力量，這樣的能量會影響所有人的心靈感受，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，靈性之門正被開啟，自身的能力將被提升，專注每個人內在的小聲音。愈處在同梁的能量裡，愈能在迷惑之間取得方向，這是一種讓智慧流動的能量，這樣的能量可以形成信仰，改變所有的生命。'
      ],
      'advantage_title': '同梁優勢',
      'advantage': '敏銳感受力強，直指人心，能看到別人看不到的角度，引導的話語很有力量，足以改變旁人內心的想法。',
      'disadvantage_title': '同梁缺點',
      'disadvantage': '好惡分明，任性妄為，想怎麼樣就怎麼樣，不管別人的感受，成熟的外表有顆幼稚的心。',
      'heart_title': '同梁提升能量的內心對白',
      'heart': [
        '『我深知自己是個有治癒能力的人，擁有一群真誠互信的好友，感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，凡能力所及一定竭盡所能，我注定會有個不凡的人生經驗，聆聽內在最深的聲音，我知道哪一條是正確的道路，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年是同梁機會滿滿的一年，首先大環境會為自己創造非常多的機會，過去的老朋友及資源再度的連結，２０１６年是建立系統成為影響力中心的開始，而結合眾人的力量是最快的成功方程式，跟愈多的通路及頂尖人脈作交流，就可以得到最多的資源及模組，而整合模組將讓自己收獲滿滿，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，放手去作吧，自己就是領導者，大步向前，眾人才有跟隨的對象，在辛苦忙碌的２０１６年，也要為自己留下個成績，一個改變遊戲規則重新定義的成績，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    },
    {
      'msg': [
        '天相是紫引牌中的協調之神，這張牌擁有盡責、福善、面子、隨和的特質。',
        '你的命宮是天相獨坐。',
        '命宮是天相獨坐的人擁有調節雙方連結的能量，自己能調節兩邊的落差使其平衡，不論是有形的物品、資產或無形的思想、能量，自己總是可以讓雙方連結起來進而交流互動。找尋這些訊息與自己之間的相關性或共通性，它們將是實現目標的引導，愈能有意識的察覺這些神奇的能量，愈能讓夢想在現實中實現出來。愈處在天相的能量裡，愈發現所有的資源及能量都透過自己而互相交流，這是一種能量調節的權力，讓人、事、物都平衡圓滿的力量。'
      ],
      'advantage_title': '天相優勢',
      'advantage': '身段靈活，感受力同理心強，一生資源不斷，連結雙方資源是自己最好的本事。',
      'disadvantage_title': '天相缺點',
      'disadvantage': '面面俱到兩邊不討好，公親變事主是非多，承攬別人的問題變成自己的問題。',
      'heart_title': '天相提升能量的內心對白',
      'heart': [
        '『我以樂觀的態度和信心協調所有的人、事、物，讓每個人、事、物都在每個位置發揮出最大的價值，我有能力居中調度，而這也將是我自身最大的價值』。',
        '２０１６年是天相借重專業的一年，過去的人際關係將會面臨重大的考驗，此時要懂得向眾人學習，尤其是上位者或長輩，他們擁有自己沒有的資源與人脈，虛心請教將可得到預料之外的協助，對方的成功模式或系統會是很好的參考。整合自己的人際關係，好好分辨哪些人值得深入交往，人脈連結的深度比廣度還來得重要，２０１６年第一：要好好的控管自身的情緒，過去都已經發生了，只有放眼未來，著重在下一步才能讓自己更美好，無謂的情緒，請在最短的時間處理好。第二：內部的支援系統要建立起來，要能應付連結的上層能量，如此才能產生豐盛的結果。'
      ]
    },
    {
      'msg': [
        '巨門是紫引牌中的溝通之神，這張牌擁有是非、疑惑、競爭、口才、醫藥的特質。',
        '你的命宮是巨門獨坐。',
        '命宮是巨門獨坐的人擁有內外連結的能量，自己能觀察到所有人外部行為想表達的內在聲音，或許是透過物品、事件、聲音或行為，自己總是可以連結到對方內在沒有表達出來的真正想法。找尋這些訊息與自己之間的相關性或共通性，它們將是實現目標的引導，調整好自己的狀態，自己將更有效的利用時間、金錢跟資源。愈處在巨門的能量裡，愈能把身邊凌亂的狀態去除，這是一種化繁為簡的能量，讓人、事、物都展現價值的力量。'
      ],
      'advantage_title': '巨門優勢',
      'advantage': '冷靜理性，敏銳觀察力強，腦筋靈活反應快，一生資源不斷，口才表達是自己最好的本事。',
      'disadvantage_title': '巨門缺點',
      'disadvantage': '疑心重，有話不說清楚，非常容易造成別人的誤解，心直口快容易禍從口出。',
      'heart_title': '巨門提升能量的內心對白',
      'heart': [
        '『以肯定的話語給出承諾，凡我承諾一定達成，天地之間必來協助，自己的話語是有力量的，這樣的力量影響著天地萬物，我必把這股力量用在提升所有人的生活品質』。',
        '２０１６年是巨門破除心門的一年，走出自己的舒適圈，跟強者互動，彼此的交流可以得到最新的訊息及想法，此時要懂得開口向眾人請教，別人的想法是打開自己智慧的鑰匙，往往彼此間觀念的交流，反而激起內心不服輸的企圖心，有了決心，走出去才能執行出來，先依計劃來執行再依狀況作調整，訂出施行步驟及時間表，是否能確實執行，將決定２０１６是否豐收，自己要有產業共好分食市場的概念，彼此合作彼此交流是雙贏最好的方式，最後在２０１６年要好好的調整自身的人際關係，有益的朋友才是最大的力量，消耗自身能量的朋友就儘量不來往，分清楚事情的輕重緩急，分清楚朋友的遠近親疏，排序是關鍵。'
      ]
    },
    {
      'msg': [
        '廉貞是紫引牌中的完美之神，這張牌擁有完美、檢討、品德、秩序的特質。',
        '貪狼是紫引牌中的遊戲之神，這張牌擁有才華、桃花、表現、慾望的特質。',
        '你的命宮是廉貞與貪狼兩顆星曜的組合。(簡稱廉貪)',
        '命宮是廉貪的人有足夠的能力可以改變陳舊的常規，本身是非常有才華及能力的人，自己的善念可以讓所有人雙贏，自己得天獨厚，所有的秩序及規則由自己來定義，自己是最重要的關鍵角色，這樣的能量會創造更多可能性，自己是創造奇蹟與實現願望的高手，惟有展現輕鬆的態度才能為自己開創全新的局面。愈處在廉貪的能量裡，愈願意在天地之間打開自己的心輪，讓豐富的想像力與心靈跟上天宇宙作連結，了解人事物的規則，是為了要讓大家都能開心過日子，自己將讓所有人的身心靈完全不同，這是一種太極的能量，這樣的能量可以扭轉乾坤，讓所有生命都得以提升。'
      ],
      'advantage_title': '廉貪優勢',
      'advantage': '剛柔並濟，企圖堅持，處事手腕靈活，天地萬物的各種資源都會靠向自己。',
      'disadvantage_title': '廉貪缺點',
      'disadvantage': '坐這山望那山，沒耐心，機會來了卻掌握不好，樣樣俱備卻不滿足，人心不足蛇吞象。',
      'heart_title': '廉貪提升能量的內心對白',
      'heart': [
        '『天地是自己的遊樂場，我清楚明白自己是遊戲規則的制定者，我不只為了自身的慾望而是全體生命，我將會把所有能量累積至最高的正能量，天地將因我而不同，不畏困難在夢想尚未到手之前決不放手，凡能力所及一定竭盡所能，自己是生命的玩家，能主宰人生往想要的方向前進，掌握人生的規則秩序，我的人生將從此不同』。',
        '２０１６年是廉貪提升境界的一年，過去聚來的各種資源，會在２０１６年統合完成並且改變市場，全新的模式將讓所有人眼睛一亮，過去一起努力的團隊，首先要加深大家的專業，再提升團隊中每個人的能力跟影響力，組成單一組織卻各自作戰的團隊，這樣的團隊首先必須訂定眾人的目標，讓大家目標一致，各自發揮最大的戰力，這全部就靠自己居中整頓了，要整合協調這樣的團隊，絕非易事，自己的行動力跟執行力都要再加倍，一方面整合各路資源，一方面把所有人的位置制定出來，市場的接受度更是重要，重視市場的聲音，內部把每個環節都鎖緊，每個人都清楚明白自己的定位，２０１６年是精彩豐盛的開始。'
      ]
    },
    {
      'msg': [
        '太陰是紫引牌中的溫柔女神，這張牌擁有才華、感情、財富、田宅的特質。',
        '你的命宮是太陰獨坐。',
        '命宮是太陰獨坐的人擁有的是全世界最強大的溫柔能量，當自己打開心門時，情感、財富、機緣及療癒性的能量都會進入生命當中，不用讓未知的情況來困擾自己，自己很有力量。發揮持續、包容、體貼的力量，這樣的能量足以改變生命層次，自己是受到上天給予祝福的，上天也會讓自己感受到生命的喜悅。愈處在太陰的能量裡，愈能在人與人之間的情感取得能量，這是一種照顧貢獻的能量，讓人、事、物都成長的力量。'
      ],
      'advantage_title': '太陰優勢',
      'advantage': '多才多藝，外柔內剛重感情，當心中有決定時絕不退縮，適應力強身段柔軟。',
      'disadvantage_title': '太陰缺點',
      'disadvantage': '晴時多雨偶陣雨，猶豫不決想得多，什麼都懂不專精，情緒化造成表現時好時壞。',
      'heart_title': '太陰提升能量的內心對白',
      'heart': [
        '『我懂得運用溫柔和包容的力量，這是專屬自己的靈性特質，感恩上天給的所有機遇，這些機緣都讓生命更加的圓滿，我會用正向積極的態度面對未來』。',
        '２０１６年是太陰調整規則的一年，規則是用來增加產值的，愈靈活愈能讓大家動起來，團隊彼此交流心得可以讓大家少走冤枉路，此時要懂得小組運作及責任分配，讓所有人都良性競爭，既是夥伴又是對手，創造出來的火花及成績，反而讓自己收獲滿滿，想法作法都要確實執行，慢一點沒關係，訂出施行步驟及時間表，是否能確實執行，將決定２０１６是否豐收，自己要有教化學習的觀念，學習跟被學習都是讓彼此更好的方式，最後在２０１６年要好好注意法規的問題，利再大，機會再好，只要牽涉到法律，一律不碰，謹記：留住青山在，不怕沒柴燒。'
      ]
    },
    {
      'msg': [
        '天府是紫引牌中的輔佐上相，這張牌擁有穩定、通才、財庫、權勢的特質。',
        '你的命宮是天府獨坐。',
        '命宮是天府獨坐的人有統合各方勢力的能力，當自己這樣作時，眾人也會來協助化解難處，自己有足夠的能力讓既有的領域再提升及產生全新的發展，自己能整合各路新想法及情報，這些新資訊可以讓所有人都攀升到更高的境界。來吧，把內心真正想要的慾望及渴望圖像化，不用擔心期待會落空，擁有的能力絕對可以讓自己過更好的生活。愈處在天府的能量裡，愈能在天地之間取得資源，條件已經俱足，放開腳步，大力向前，這是一種穩定的能量，讓人、事、物都穩定的力量。'
      ],
      'advantage_title': '天府優勢',
      'advantage': '運籌帷幄，穩重踏實，各路英雄齊相聚，得權得利眾人都稱羨。',
      'disadvantage_title': '天府缺點',
      'disadvantage': '固執堅持，個性愛指揮，說得比作得多，欠缺行動力。',
      'heart_title': '天府提升能量的內心對白',
      'heart': [
        '『我將會對任何人貢獻心力，我願帶領大家往更好的境界提升，我接受領導也能領導別人，勇敢追夢的過程也會欣然接受上天給予的任何經驗，那將是豐富人生的元素』。',
        '２０１６年是天府人脈連結的一年，認識愈多的人，可以得到更多的訊息及資源，此時要懂得向眾人學習，別人是鏡子更是導師，往往一句無心的話，反而讓自己找到新的機會，整合自己的人際關係，好好分辨哪些人值得深入交往，人脈連結的深度比廣度還來得重要，更要找到自己的接班人，給對方全面性的訓練，讓他可以成為自己的分身，最後在２０１６年要好好的調整自身的想法，大環境變化的速度超過想像，隨時更新想法，才能找出市場的脈絡，誰掌握市場，誰就是最大的贏家。'
      ]
    },
    {
      'msg': [
        '命宮是空宮（表示沒有任何十四主星者）的人，擁有無限的可能，創意十足，熱愛自由，無法被任何主星所規範。空宮會被對宮的主星所影響，因此空宮我們用對宮的主星來解釋會比較理想。',
        '對宮的主星是：',
        '天同是紫引牌中的福德之神，這張牌擁有融和、人和、感情、協調的特質。',
        '天梁是紫引牌中的福蔭之神，這張牌擁有統御、毅力、規則、庇蔭的特質。',
        '你的對宮是天同與天梁兩顆星曜的組合。(簡稱同梁)',
        '命宮空宮而對宮是同梁的人是個敦厚而仁慈的人，總是扛起重責大任，總是承擔所有孤寂，本身擁有教化的力量，這樣的能量會影響所有人的心靈感受，人與人之間的互動會讓自己充滿對生命的熱情！大家都會全力支持自己，敞開心接受人與人之間流動的能量，靈性之門正被開啟，自身的能力將被提升，專注每個人內在的小聲音。愈處在同梁的能量裡，愈能在迷惑之間取得方向，這是一種讓智慧流動的能量，這樣的能量可以形成信仰，改變所有的生命。'
      ],
      'advantage_title': '命宮空宮而對宮是同梁優勢',
      'advantage': '敏銳感受力強，直指人心，能看到別人看不到的角度，引導的話語很有力量，足以改變旁人內心的想法。',
      'disadvantage_title': '命宮空宮而對宮是同梁缺點',
      'disadvantage': '好惡分明，任性妄為，想怎麼樣就怎麼樣，不管別人的感受，成熟的外表有顆幼稚的心。',
      'heart_title': '命宮空宮而對宮是同梁提升能量的內心對白',
      'heart': [
        '『我深知自己是個有治癒能力的人，擁有一群真誠互信的好友，感恩大家對自己的關懷及付出，任何人有任何難關，我們都會一起面對，凡能力所及一定竭盡所能，我注定會有個不凡的人生經驗，聆聽內在最深的聲音，我知道哪一條是正確的道路，就讓所有人都發揮能量與行動力，使結果都能豐盛』。',
        '２０１６年命宮空宮而對宮是同梁機會滿滿的一年，首先大環境會為自己創造非常多的機會，過去的老朋友及資源再度的連結，２０１６年是建立系統成為影響力中心的開始，而結合眾人的力量是最快的成功方程式，跟愈多的通路及頂尖人脈作交流，就可以得到最多的資源及模組，而整合模組將讓自己收獲滿滿，同時在事業上，也是個發展快速的一年，此時正是自己表現的機會，放手去作吧，自己就是領導者，大步向前，眾人才有跟隨的對象，在辛苦忙碌的２０１６年，也要為自己留下個成績，一個改變遊戲規則重新定義的成績，好消息是：自己將有一個完整的２０１６可以達成。'
      ]
    }
  ];

  // 卡牌圖片表
  var images = [
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_01.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_02.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_03.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_04.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_05.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_06.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_07.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_08.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_09.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_10.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_11.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_12.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_01.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_02.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_15.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_04.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_05.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_06.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_09.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_08.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_14.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_10.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_01.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_02.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_11.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_04.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_05.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_06.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_03.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_09.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_07.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_08.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_01.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_02.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_14.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_04.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_05.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_06.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_15.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_09.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_01.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_02.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_07.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_04.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_05.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_06.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_11.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_12.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_09.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_03.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_01.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_02.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_04.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_05.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_06.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_14.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_10.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_09.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_12.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_15.png',
    'https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_result_13.png'
  ]

  // 開運小物表
  var articleInfo = [
    [4, 7, 9],
    [1, 6, 9],
    [8, 4, 5],
    [7, 6, 5],
    [3, 8, 4],
    [7, 2, 4],
    [9, 7, 5],
    [6, 7, 9],
    [9, 7, 4],
    [2, 3, 7],
    [7, 3, 5],
    [9, 7, 6],
    [5, 7, 9],
    [6, 3, 9],
    [3, 3, 7],
    [7, 6, 8],
    [3, 8, 6],
    [7, 8, 3],
    [3, 7, 5],
    [1, 6, 5],
    [1, 9, 7],
    [7, 5, 1],
    [6, 7, 2],
    [2, 4, 9],
    [7, 4, 2],
    [1, 6, 7],
    [7, 9, 1],
    [5, 7, 6],
    [8, 3, 6],
    [7, 4, 2],
    [5, 8, 6],
    [2, 2, 5],
    [6, 2, 5],
    [7, 3, 6],
    [6, 9, 7],
    [5, 9, 2],
    [4, 6, 7],
    [1, 6, 3],
    [5, 6, 4],
    [2, 7, 6],
    [8, 3, 4],
    [7, 8, 3],
    [9, 7, 2],
    [1, 6, 5],
    [1, 4, 6],
    [5, 2, 6],
    [8, 7, 2],
    [8, 7, 3],
    [5, 9, 4],
    [9, 7, 5],
    [9, 1, 3],
    [6, 8, 2],
    [3, 3, 4],
    [7, 2, 8],
    [7, 5, 1],
    [8, 7, 3],
    [3, 7, 5],
    [8, 5, 4],
    [8, 5, 6],
    [2, 7, 6],
    [8, 7, 4],
    [1, 6, 4],
    [8, 7, 6],
    [7, 6, 1],
    [8, 3, 1],
    [7, 2, 4],
    [7, 5, 4],
    [7, 5, 4],
    [2, 6, 7],
    [1, 7, 5],
    [3, 6, 9],
    [7, 8, 5]
  ]

  article_title = [
    '',
    '藍色 - 開啟智慧之窗',
    '紅色 - 溝通一級棒',
    '紫色 - 財運旺旺來',
    '綠色 - 事業一飛沖天',
    '紫色 - 自信滿滿',
    '綠色 - 求新求改變',
    '黃色 - 增進好人緣',
    '紅色 - 創意滿分',
    '橘色 - 衝衝衝勁一百勁一百'
  ]

  article_link = [
    '',
    'https://commandp.com/search?model=glass_case&query=開啟智慧之窗',
    'https://commandp.com/search?model=glass_case&query=溝通一級棒',
    'https://commandp.com/search?model=glass_case&query=財運旺旺來',
    'https://commandp.com/search?model=glass_case&query=事業一飛沖天',
    'https://commandp.com/search?model=glass_case&query=自信滿滿',
    'https://commandp.com/search?model=glass_case&query=求新求改變',
    'https://commandp.com/search?model=glass_case&query=增進好人緣',
    'https://commandp.com/search?model=glass_case&query=創意滿分',
    'https://commandp.com/search?model=glass_case&query=衝衝衝勁一百勁一百'
  ]

  var map = {
    '0,6:0:12': 0,
    '0,6:6:12': 0,
    '1:11:11': 1,
    '1:5:11': 1,
    '13:10:5,10': 2,
    '13:4:5,10': 2,
    '2:3:9': 3,
    '2:9:9': 3,
    '3:2:8': 4,
    '3:8:8': 4,
    '4:1:7': 5,
    '4:7:7': 5,
    '12:0:0,6': 6,
    '12:6:0,6': 6,
    '11:5:1': 7,
    '11:11:1': 7,
    '5,10:4:13': 8,
    '5,10:10:13': 8,
    '9:3:2': 9,
    '9:9:2': 9,
    '8:2:3': 10,
    '8:8:3': 10,
    '7:1:4': 11,
    '7:7:4': 11,
    '0,8:1:': 12,
    '0,8:7:': 12,
    '1,7:0:': 13,
    '1,7:6:': 13,
    '6:5:5,12': 14,
    '6:11:5,12': 14,
    '2:4:11': 15,
    '2:10:11': 15,
    '3,13:3:10': 16,
    '3,13:9:10': 16,
    '4:2:9': 17,
    '4:8:9': 17,
    ':1:0,8': 18,
    ':7:0,8': 18,
    ':0:1,7': 19,
    ':6:1,7': 19,
    '5,12:5:6': 20,
    '5,12:11:6': 20,
    '11:4:2': 21,
    '11:10:2': 21,
    '10:3:3,13': 22,
    '10:9:3,13': 22,
    '9:2:4': 23,
    '9:8:4': 23,
    '0,10:2:13': 24,
    '0,10:8:13': 24,
    '1,9:1:': 25,
    '1,9:7:': 25,
    '8:0:5': 26,
    '8:6:5': 26,
    '2,7:5:': 27,
    '2,7:11:': 27,
    '3,6:4:12': 28,
    '3,6:10:12': 28,
    '4:3:11': 29,
    '4:9:11': 29,
    '13:2:0,10': 30,
    '13:8:0,10': 30,
    ':1:1,9': 31,
    ':7:1,9': 31,
    '5:0:8': 32,
    '5:6:8': 32,
    ':5:2,7': 33,
    ':11:2,7': 33,
    '12:4:3,6': 34,
    '12:10:3,6': 34,
    '11:3:4': 35,
    '11:9:4': 35,
    '0,12:3:6': 36,
    '0,12:9:6': 36,
    '1,11:2:': 37,
    '1,11:8:': 37,
    '10:1:5,13': 38,
    '10:7:5,13': 38,
    '2,9:0:': 39,
    '2,9:6:': 39,
    '3,8:5:': 40,
    '3,8:11:': 40,
    '4,7:4:': 41,
    '4,7:10:': 41,
    '6:3:0,12': 42,
    '6:9:0,12': 42,
    ':2:1,11': 43,
    ':8:1,11': 43,
    '5,13:1:10': 44,
    '5,13:7:10': 44,
    ':0:2,9': 45,
    ':6:2,9': 45,
    ':5:3,8': 46,
    ':11:3,8': 46,
    ':4:4,7': 47,
    ':10:4,7': 47,
    '0:4:8': 48,
    '0:10:8': 48,
    '1:3:7': 49,
    '1:9:7': 49,
    '12:2:5,6': 50,
    '12:8:5,6': 50,
    '2,11:1:': 51,
    '2,11:7:': 51,
    '3,10:0:13': 52,
    '3,10:6:13': 52,
    '4,9:5:': 53,
    '4,9:11:': 53,
    '8:4:0': 54,
    '8:10:0': 54,
    '7:3:1': 55,
    '7:9:1': 55,
    '5,6:2:12': 56,
    '5,6:8:12': 56,
    ':1:2,11': 57,
    ':7:2,11': 57,
    '13:0:3,10': 58,
    '13:6:3,10': 58,
    ':5:4,9': 59,
    ':11:4,9': 59,
    '0,13:5:10': 60,
    '0,13:11:10': 60,
    '1:4:9': 61,
    '1:10:9': 61,
    ':3:5,8': 62,
    ':9:5,8': 62,
    '2:2:7': 63,
    '2:8:7': 63,
    '3,12:1:6': 64,
    '3,12:7:6': 64,
    '4,11:0:': 65,
    '4,11:6:': 65,
    '10:5:0,13': 66,
    '10:11:0,13': 66,
    '9:4:1': 67,
    '9:10:1': 67,
    '5,8:3:': 68,
    '5,8:9:': 68,
    '7:2:2': 69,
    '7:8:2': 69,
    '6:1:3,12': 70,
    '6:7:3,12': 70,
    ':0:4,11': 71,
    ':6:4,11': 71
  };
  this.getInfo = function (selfStars,location,travelStars) {
    var inx = selfStars.join(',') + ':' + location + ':' + travelStars.join(',');
    var resultIndex = map[inx];
    var result = info[resultIndex];
    result.article = articleInfo[resultIndex].map(function(index){
      return {
        img: "https://d2i5hifyddc647.cloudfront.net/campaign/2016/2016lucky/img_design_" + index + ".png",
        title: article_title[index],
        link: article_link[index],
      };
    });
    result.images = images[resultIndex];
    return result || '找不到對應解釋!!';
  }
}
